<?
/******************************************************
* system  : xxx リスク診断
* title   : 証券診断計算処理
* content : 保険評価に於ける証券診断関連の計算を行う
* version : 1.0
* author  : aizawa
*******************************************************/

// ■保険評価／証券診断データ計算
function calc_shoken_shindan() {
	global $g_encode, $g_decode, $g_const, $g_sheets;

	$n = '証券診断';
	$g_sheets[$n] = array();
	$s = &$g_sheets;
	$c = &$g_sheets[$n];

	// 定数
	$c['A50'] = 0;
	$c['A51'] = 0.5;
	$c['A52'] = 1;
	$c['A53'] = 1.5;
	$c['A54'] = 2;
	$c['A55'] = 2.5;
	$c['A56'] = 3;
	$c['A57'] = 3.5;
	$c['A58'] = 4;
	$c['A59'] = 4.5;
	$c['A60'] = 5;
	$c['B50'] = '0';
	$c['B51'] = '1';
	$c['B52'] = '2';
	$c['B53'] = '3';
	$c['B54'] = '4';
	$c['B55'] = '5';
	$c['B56'] = '6';
	$c['B57'] = '7';
	$c['B58'] = '8';
	$c['B59'] = '9';
	$c['B60'] = '10';

	// 本人・契約一覧
	for ($i = 1; $i <= $s['生保']['D5']; $i++) {
		$c['A6'][$i] = $s['生保']['D8'][$i];
		$c['A7'][$i] = $s['生保']['D9'][$i];
		$c['A8'][$i] = $g_decode['保険種別'][$s['生保']['D10'][$i]];
		$c['B6'][$i] = $s['生保']['D112'][$i];
		$c['D7'][$i] = $s['生保']['D37'][$i];
		$c['F7'][$i] = $s['生保']['D50'][$i] + $s['生保']['D70'][$i];
		$c['H6'][$i] = $s['生保']['D128'][$i];
		$c['J6'][$i] = $s['生保']['D91'][$i];
		$c['J7'][$i] = $s['生保']['D97'][$i];
		$c['L6'][$i] = '−';
	}
	for ($i = 1; $i <= $s['損保']['C2']; $i++) {
		$c['A16'][$i] = $s['損保']['C5'][$i];
		$c['A17'][$i] = $s['損保']['C6'][$i];
		$c['A18'][$i] = $g_decode['損保保険種別'][$s['損保']['C13'][$i]];
		$c['B16'][$i] = $s['損保']['C65'][$i];
		$c['D16'][$i] = '−';
		$c['F16'][$i] = '−';
		$c['H16'][$i] = '−';
		$c['J16'][$i] = $s['損保']['C31'][$i];
		$c['J17'][$i] = $s['損保']['C37'][$i];
		$c['L16'][$i] = VB_IF($s['損保']['C12'][$i] == "", " - ", $g_decode['損保保険種目'][$s['損保']['C12'][$i]]);
	}
	$c['B22'] = VB_SUM($n, 'B6:B21');
	$c['D22'] = VB_SUM($n, 'D7');
	$c['F22'] = VB_SUM($n, 'F7');
	$c['H22'] = VB_SUM($n, 'H6:H21');
	$c['J22'] = VB_SUM($n, 'J6') + VB_SUM($n, 'J16');
	$c['J23'] = VB_SUM($n, 'J7') + VB_SUM($n, 'J17');

	// 本人・入院時給付一覧
	for ($i = 1; $i <= $s['生保']['D5']; $i++) {
		$c['M6'][$i] = $c['A6'][$i];
		$c['M7'][$i] = $c['A7'][$i];
		$c['M8'][$i] = $c['A8'][$i];

		$c['N6'][$i] = $s['生保']['D50'][$i];
		$c['P6'][$i] = $s['生保']['D51'][$i];
		$c['R6'][$i] = $s['生保']['D50'][$i] + $s['生保']['D52'][$i];
		$c['R7'][$i] = $s['生保']['D57'][$i];
		$c['T6'][$i] = $s['生保']['D50'][$i] + $s['生保']['D52'][$i] + $s['生保']['D53'][$i];
		$c['T7'][$i] = $s['生保']['D57'][$i] + $s['生保']['D58'][$i];
		$c['V6'][$i] = $s['生保']['D50'][$i] + $s['生保']['D52'][$i];
		$c['V7'][$i] = $s['生保']['D57'][$i];
		$c['X6'][$i] = $s['生保']['D50'][$i] + $s['生保']['D52'][$i];
		$c['X7'][$i] = 0;

		$c['N8'][$i] = $s['生保']['D70'][$i];
		$c['P8'][$i] = $s['生保']['D71'][$i];
		$c['R8'][$i] = $s['生保']['D70'][$i] + $s['生保']['D72'][$i];
		$c['R9'][$i] = $s['生保']['D77'][$i];
		$c['T8'][$i] = $s['生保']['D70'][$i] + $s['生保']['D72'][$i] + $s['生保']['D73'][$i];
		$c['T9'][$i] = $s['生保']['D77'][$i] + $s['生保']['D78'][$i];
		$c['V8'][$i] = $s['生保']['D70'][$i] + $s['生保']['D72'][$i];
		$c['V9'][$i] = $s['生保']['D77'][$i];
		$c['X8'][$i] = $s['生保']['D70'][$i] + $s['生保']['D72'][$i];
		$c['X9'][$i] = 0;
	}
	$c['N22'] = VB_SUM($n, 'N6:N21');
	$c['P22'] = VB_SUM($n, 'P6:P21');
	$c['R22'] = VB_SUM($n, 'R6');
	$c['R23'] = VB_SUM($n, 'R7');
	$c['T22'] = VB_SUM($n, 'T6');
	$c['T23'] = VB_SUM($n, 'T7');
	$c['V22'] = VB_SUM($n, 'V6');
	$c['V23'] = VB_SUM($n, 'V7');
	$c['X22'] = VB_SUM($n, 'X6');
	$c['X23'] = VB_SUM($n, 'X7');

	// 本人・医療保障評価
	for ($i = 1; $i <= $s['生保']['D5']; $i++) {
		$c['Z6'][$i] = $c['A6'][$i];
		$c['Z7'][$i] = $c['A7'][$i];
		$c['Z8'][$i] = $c['A8'][$i];
		$c['AB6'][$i] = VB_VLOOKUP($n, $s['医療保険']['D45'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AB7'][$i] = VB_VLOOKUP($n, $s['医療保険']['E45'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AC6'][$i] = VB_VLOOKUP($n, $s['医療保険']['D41'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AC7'][$i] = VB_VLOOKUP($n, $s['医療保険']['E41'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AD6'][$i] = VB_VLOOKUP($n, $s['医療保険']['D42'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AD7'][$i] = VB_VLOOKUP($n, $s['医療保険']['E42'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AE6'][$i] = VB_VLOOKUP($n, $s['医療保険']['D43'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AE7'][$i] = VB_VLOOKUP($n, $s['医療保険']['E43'][$i], 'A50:B61', 2, TRUE, '0');
		$c['AF6'][$i] = VB_VLOOKUP($n, $s['医療保険']['D44'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AF7'][$i] = VB_VLOOKUP($n, $s['医療保険']['E44'][$i], 'A50:B60', 2, TRUE, '0');
	}

	// 本人・死亡保障評価
	for ($i = 1; $i <= $s['生保']['D5']; $i++) {
		$c['AG6'][$i] = $c['Z6'][$i];
		$c['AG7'][$i] = $c['Z7'][$i];
		$c['AG8'][$i] = $c['Z8'][$i];
/* 主契約と特約に分ける
		$c['AH6'][$i] = $s['生保']['D37'][$i];
		$c['AJ6'][$i] = $s['生保']['D37'][$i] + $s['生保']['D35'][$i];
*/
		$c['AH6'][$i] = $s['死亡保険']['D40'][$i];
		$c['AH7'][$i] = $s['死亡保険']['E40'][$i];
		$c['AJ6'][$i] = $s['死亡保険']['D40'][$i] + $s['死亡保険']['D26'][$i];
		$c['AJ7'][$i] = $s['死亡保険']['E40'][$i] + $s['死亡保険']['E26'][$i];

		$c['AM6'][$i] = VB_VLOOKUP($n, $s['死亡保険']['D46'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AM7'][$i] = VB_VLOOKUP($n, $s['死亡保険']['E46'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AN6'][$i] = VB_VLOOKUP($n, $s['死亡保険']['D44'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AN7'][$i] = VB_VLOOKUP($n, $s['死亡保険']['E44'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AO6'][$i] = VB_VLOOKUP($n, $s['死亡保険']['D42'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AO7'][$i] = VB_VLOOKUP($n, $s['死亡保険']['E42'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AP6'][$i] = VB_VLOOKUP($n, $s['死亡保険']['D43'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AP7'][$i] = VB_VLOOKUP($n, $s['死亡保険']['E43'][$i], 'A50:B60', 2, TRUE, '0');
	}

	// 配偶者・契約一覧
	for ($i = 1; $i <= $s['生保']['D139']; $i++) {
		$c['A30'][$i] = $s['生保']['D142'][$i];
		$c['A31'][$i] = $s['生保']['D143'][$i];
		$c['A32'][$i] = $g_decode['保険種別'][$s['生保']['D144'][$i]];
		$c['B30'][$i] = $s['生保']['D237'][$i];
		$c['D31'][$i] = $s['生保']['D171'][$i];
		$c['F31'][$i] = $s['生保']['D180'][$i] + $s['生保']['D194'][$i];
		$c['H30'][$i] = $s['生保']['D253'][$i];
		$c['J30'][$i] = $s['生保']['D215'][$i];
		$c['J31'][$i] = $s['生保']['D221'][$i];
		$c['L30'][$i] = '−';
	}
	for ($i = 1; $i <= $s['損保']['C2']; $i++) {
		$c['A40'][$i] = $s['損保']['C5'][$i];
		$c['A41'][$i] = $s['損保']['C6'][$i];
		$c['A42'][$i] = $g_decode['損保保険種別'][$s['損保']['C13'][$i]];
		$c['B40'][$i] = 0;
		$c['D40'][$i] = '−';
		$c['F40'][$i] = '−';
		$c['H40'][$i] = '−';
		$c['J40'][$i] = $s['損保']['C39'][$i];
		$c['J41'][$i] = $s['損保']['C45'][$i];
		$c['L40'][$i] = VB_IF($s['損保']['C12'][$i] == "", " - ", $g_decode['損保保険種目'][$s['損保']['C12'][$i]]);
	}
	$c['B46'] = VB_SUM($n, 'B30:B45');
	$c['D46'] = VB_SUM($n, 'D31');
	$c['F46'] = VB_SUM($n, 'F31');
	$c['H46'] = VB_SUM($n, 'H30:H45');
	$c['J46'] = VB_SUM($n, 'J30') + VB_SUM($n, 'J40');
	$c['J47'] = VB_SUM($n, 'J31') + VB_SUM($n, 'J41');

	// 配偶者・入院時給付一覧
	for ($i = 1; $i <= $s['生保']['D139']; $i++) {
		$c['M30'][$i] = $c['A30'][$i];
		$c['M31'][$i] = $c['A31'][$i];
		$c['M32'][$i] = $c['A32'][$i];

		$c['N30'][$i] = $s['生保']['D180'][$i];
		$c['P30'][$i] = $s['生保']['D181'][$i];
		$c['R30'][$i] = $s['生保']['D180'][$i] + $s['生保']['D182'][$i];
		$c['R31'][$i] = $s['生保']['D187'][$i];
		$c['T30'][$i] = $s['生保']['D180'][$i] + $s['生保']['D182'][$i] + $s['生保']['D183'][$i];
		$c['T31'][$i] = $s['生保']['D187'][$i] + $s['生保']['D188'][$i];
		$c['V30'][$i] = $s['生保']['D180'][$i] + $s['生保']['D182'][$i];
		$c['V31'][$i] = $s['生保']['D187'][$i];
		$c['X30'][$i] = $s['生保']['D180'][$i] + $s['生保']['D182'][$i];
		$c['X31'][$i] = 0;

		$c['N32'][$i] = $s['生保']['D194'][$i];
		$c['P32'][$i] = $s['生保']['D195'][$i];
		$c['R32'][$i] = $s['生保']['D194'][$i] + $s['生保']['D196'][$i];
		$c['R33'][$i] = $s['生保']['D201'][$i];
		$c['T32'][$i] = $s['生保']['D194'][$i] + $s['生保']['D196'][$i] + $s['生保']['D197'][$i];
		$c['T33'][$i] = $s['生保']['D201'][$i] + $s['生保']['D202'][$i];
		$c['V32'][$i] = $s['生保']['D194'][$i] + $s['生保']['D196'][$i];
		$c['V33'][$i] = $s['生保']['D201'][$i];
		$c['X32'][$i] = $s['生保']['D194'][$i] + $s['生保']['D196'][$i];
		$c['X33'][$i] = 0;
	}
	$c['N46'] = VB_SUM($n, 'N30:N45');
	$c['P46'] = VB_SUM($n, 'P30:P45');
	$c['R46'] = VB_SUM($n, 'R30');
	$c['R47'] = VB_SUM($n, 'R31');
	$c['T46'] = VB_SUM($n, 'T30');
	$c['T47'] = VB_SUM($n, 'T31');
	$c['V46'] = VB_SUM($n, 'V30');
	$c['V47'] = VB_SUM($n, 'V31');
	$c['X46'] = VB_SUM($n, 'X30');
	$c['X47'] = VB_SUM($n, 'X31');

	// 配偶者・医療保障評価
	for ($i = 1; $i <= $s['生保']['D139']; $i++) {
		$c['Z30'][$i] = $c['A30'][$i];
		$c['Z31'][$i] = $c['A31'][$i];
		$c['Z32'][$i] = $c['A32'][$i];
		$c['AB30'][$i] = VB_VLOOKUP($n, $s['医療保険']['D92'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AB31'][$i] = VB_VLOOKUP($n, $s['医療保険']['E92'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AC30'][$i] = VB_VLOOKUP($n, $s['医療保険']['D88'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AC31'][$i] = VB_VLOOKUP($n, $s['医療保険']['E88'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AD30'][$i] = VB_VLOOKUP($n, $s['医療保険']['D89'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AD31'][$i] = VB_VLOOKUP($n, $s['医療保険']['E89'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AE30'][$i] = VB_VLOOKUP($n, $s['医療保険']['D90'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AE31'][$i] = VB_VLOOKUP($n, $s['医療保険']['E90'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AF30'][$i] = VB_VLOOKUP($n, $s['医療保険']['D91'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AF31'][$i] = VB_VLOOKUP($n, $s['医療保険']['E91'][$i], 'A50:B60', 2, TRUE, '0');
	}

	// 配偶者・死亡保障評価
	for ($i = 1; $i <= $s['生保']['D139']; $i++) {
		$c['AG30'][$i] = $c['Z30'][$i];
		$c['AG31'][$i] = $c['Z31'][$i];
		$c['AG32'][$i] = $c['Z32'][$i];
/* 主契約と特約に分ける
		$c['AH30'][$i] = $s['生保']['D171'][$i];
		$c['AJ30'][$i] = $s['生保']['D171'][$i] + $s['生保']['D169'][$i];
*/
		$c['AH30'][$i] = $s['死亡保険']['D93'][$i];
		$c['AH31'][$i] = $s['死亡保険']['E93'][$i];
		$c['AJ30'][$i] = $s['死亡保険']['D93'][$i] + $s['死亡保険']['D79'][$i];
		$c['AJ31'][$i] = $s['死亡保険']['E93'][$i] + $s['死亡保険']['E79'][$i];

		$c['AM30'][$i] = VB_VLOOKUP($n, $s['死亡保険']['D99'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AM31'][$i] = VB_VLOOKUP($n, $s['死亡保険']['E99'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AN30'][$i] = VB_VLOOKUP($n, $s['死亡保険']['D97'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AN31'][$i] = VB_VLOOKUP($n, $s['死亡保険']['E97'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AO30'][$i] = VB_VLOOKUP($n, $s['死亡保険']['D95'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AO31'][$i] = VB_VLOOKUP($n, $s['死亡保険']['E95'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AP30'][$i] = VB_VLOOKUP($n, $s['死亡保険']['D96'][$i], 'A50:B60', 2, TRUE, '0');
		$c['AP31'][$i] = VB_VLOOKUP($n, $s['死亡保険']['E96'][$i], 'A50:B60', 2, TRUE, '0');
	}

	// 損害保険一覧
	for ($i = 1; $i <= $s['損保']['C2']; $i++) {
		$c['AQ6'][$i] = $s['損保']['C5'][$i];
		$c['AQ7'][$i] = $s['損保']['C6'][$i];
		$c['AQ8'][$i] = $g_decode['損保保険種別'][$s['損保']['C13'][$i]];
		$c['AR6'][$i] = $s['損保']['C16'][$i];
		$c['AR7'][$i] = $s['損保']['C18'][$i];
		$c['AT6'][$i] = $s['損保']['C17'][$i];
		$c['AT7'][$i] = $s['損保']['C19'][$i];
		$c['AV6'][$i] = $s['損保']['C21'][$i];
		$c['AV7'][$i] = $s['損保']['C22'][$i];
		$c['AX6'][$i] = $s['損保']['C27'][$i];
	}
	$c['AR22'] = VB_SUM($n, 'AR6');
	$c['AR23'] = VB_SUM($n, 'AR7');
	$c['AT22'] = VB_SUM($n, 'AT6');
	$c['AT23'] = VB_SUM($n, 'AT7');
	$c['AV22'] = VB_SUM($n, 'AV6');
	$c['AV23'] = VB_SUM($n, 'AV7');
	$c['AX22'] = VB_SUM($n, 'AX6');
}
?>