<?
/******************************************************
* system  : xxx リスク診断
* title   : 定数定義
* content : 各計算処理で使用する定数の定義
* version : 1.0
* author  : aizawa
*******************************************************/

// ▼共通定数テーブル定義
$g_const = array(
	// 年間教育費
	'年間教育費' => array(
		'幼稚園' => array('入学年齢' => 4, '費用' => array(1 => 24, 2 => 50)),
		'小学校' => array('入学年齢' => 6, '費用' => array(1 => 30, 2 => 79)),
		'中学校' => array('入学年齢' => 12, '費用' => array(1 => 44, 2 => 123)),
		'高校' => array('入学年齢' => 15, '費用' => array(1 => 51, 2 => 100)),
		'大学前2年' => array('入学年齢' => 18, '費用' => array(1 => 70, 2 => 120)),
		'大学後2年' => array('入学年齢' => 20, '費用' => array(1 => 70, 2 => 120))
	),
	'仕送り' => array(1 => 120, 2 => 120),

	// 就職年齢
	'就職年齢' => 22,

	// 初任給
	'初任給' => 300,

	// 死亡時＆就業不能時賃貸方針
	'賃貸方針' => array(
		1 => 1,			// 現在の賃料継続
		2 => 0.7,		// 家賃減額
		3 => 0,			// 家賃負担なし（実家など）
		4 => 0			// その他家賃不要
	),

	// 育児に関わる家事費用[月額]
	'育児に関わる家事費用' => array(
		1 => 0,			// 現状通り（追加費用不要）
		2 => 10			// 追加費用が必要
	),

	// ベビーシッター・保育園費用[月額]
	'保育園費用' => array(
		1 => 0,			// 現状通り（追加費用不要）
		2 => 1			// 追加費用が必要
	),

	// 子供生活費割合
	'子供生活費割合' => 0.08,

	// 葬儀費用
	'葬儀費用' => array(
		1 => 160,			// 低め
		2 => 240,			// 平均
		3 => 370			// 高め
	),

	// 課税所得
	'課税所得' => array(
		0 => array('税率' => 0.15, '控除額' => 0),
		200 => array('税率' => 0.2, '控除額' => 10),
		330 => array('税率' => 0.3, '控除額' => 43),
		700 => array('税率' => 0.33, '控除額' => 64),
		900 => array('税率' => 0.43, '控除額' => 154),
		1800 => array('税率' => 0.5, '控除額' => 280)
	),

	// 給与収入
	'給与収入' => array(
		0 => array('掛率' => 0, '金額' => 65),
		162.5 => array('掛率' => 0.4, '金額' => 0),
		180 => array('掛率' => 0.3, '金額' => 18),
		360 => array('掛率' => 0.2, '金額' => 54),
		660 => array('掛率' => 0.1, '金額' => 120),
		1000 => array('掛率' => 0.05, '金額' => 170)
	),

	// 老齢年金支給開始年齢
	'老齢年金支給開始年齢' => array(
		// 男性
		1 => array(
			1941 => array('厚生年金' => 60, '国民年金' => 60),
			1943 => array('厚生年金' => 60, '国民年金' => 61),
			1945 => array('厚生年金' => 60, '国民年金' => 62),
			1947 => array('厚生年金' => 60, '国民年金' => 63),
			1949 => array('厚生年金' => 60, '国民年金' => 64),
			1953 => array('厚生年金' => 60, '国民年金' => 65),
			1955 => array('厚生年金' => 61, '国民年金' => 65),
			1957 => array('厚生年金' => 62, '国民年金' => 65),
			1959 => array('厚生年金' => 63, '国民年金' => 65),
			1961 => array('厚生年金' => 64, '国民年金' => 65),
			9999 => array('厚生年金' => 65, '国民年金' => 65)
		),
		// 女性
		2 => array(
			1946 => array('厚生年金' => 60, '国民年金' => 60),
			1948 => array('厚生年金' => 60, '国民年金' => 61),
			1950 => array('厚生年金' => 60, '国民年金' => 62),
			1952 => array('厚生年金' => 60, '国民年金' => 63),
			1954 => array('厚生年金' => 60, '国民年金' => 64),
			1958 => array('厚生年金' => 60, '国民年金' => 65),
			1960 => array('厚生年金' => 61, '国民年金' => 65),
			1962 => array('厚生年金' => 62, '国民年金' => 65),
			1964 => array('厚生年金' => 63, '国民年金' => 65),
			1966 => array('厚生年金' => 64, '国民年金' => 65),
			9999 => array('厚生年金' => 65, '国民年金' => 65)
		)
	),

	// 住宅形態
	'住宅形態' => array(
		1 => 25,
		2 => 17,
		3 => 25,
		4 => 17
	),

	// 家財評価
	'家財評価' => array(
		// 本人&配偶者
		'本人' => array(
			0 => 300,
			30 => 500,
			40 => 700,
			50 => 750
		),
		'子供' => 80
	),

	// 病気別の平均
	'病気別平均' => array(
		'病気' => array('入院患者数' => 0.57, '平均日数' => 40, '診療費' => 2.1, '診察外算出係数' => 0.1),
		'けが' => array('入院患者数' => 0.08, '平均日数' => 35, '診療費' => 2.3, '診察外算出係数' => 0.1),
		'脳卒中' => array('入院患者数' => 0.16, '平均日数' => 110, '診療費' => 1.7, '診察外算出係数' => 0.8),
		'がん' => array('入院患者数' => 0.12, '平均日数' => 98.7, '診療費' => 3.7, '診察外算出係数' => 1),
		'心筋梗塞' => array('入院患者数' => 0.04, '平均日数' => 32, '診療費' => 1.9, '診察外算出係数' => 0.8),
		'糖尿病' => array('入院患者数' => 0.02, '平均日数' => 47, '診療費' => 2.7, '診察外算出係数' => 0.8),
	),

	// 差額ベッド代
	'差額ベッド代' => array(
		1 => 0,
		2 => 0.5,
		3 => 1
	),

	// 医療リスク算出用定数
	'自己負担上限額算出用定数' => 672,
//#	'分岐率算出係数' => 0.3,

	// 損害係数
	'損害係数' => array(
		'火災' => 0.2,
		'地震' => 0.2,
		'盗難' => 0.2,
		'事故' => 0.03,
		'損害賠償' => 0.01
	),

	// その他指定された定数
	'寿命' => 85,
	'年金開始' => 65,
	'定年' => 60,
	'扶養上限' => 18,
	'保育年額' => 60,

	// 各種法的な係数
	'被扶養者年収上限' => 850,
	'年金加入年収' => 130,
	'標準報酬上限額' => 74.5,
	'所得税控除額掛け率' => 38,
	'社会保険料掛け率' => 0.11,
	'社会保険料上限額' => 104,

	// 遺族国民年金支給額
	'遺族国民年金支給額' => array(
		'基本支給額' => 79.7,
		'第一子' => 22.9,
		'第二子' => 22.9,
		'第三子以降' => 7.6,
		'遺族厚生年金掛け率' => 5.481,
		'中高齢寡婦加算額' => 59.8,
		'老齢国民年金掛け率' => 79.7,
		'老齢厚生年金掛け率' => 5.481,
		'加給年金基本金額' => 40.0,
		'厚生年金下限' => 300,
		'中高齢寡婦加算支給開始年齢' => 40,
		'中高齢寡婦加算対象年齢' => 35
	)
);

// ▼死亡保険診断用定数テーブル定義
$g_const_sb = array(
	'保険料割安さポイント' => array(
		'1900/01/01' => 100,
		'1992/12/31' => 87.8795006295105,
		'1993/12/31' => 74.2719433376291,
		'1995/12/31' => 63.0831873897775,
		'1998/12/31' => 56.0058141971681,
		'2000/12/31' => 48.0218982572376
	),
	'変額終身' => 84.2226369803915,
	'死亡保険評価重み' => array(
		'保険料安定度' => 0.5,
		'保険料の割安さ' => 0.3,
		'継続性' => 0.2
	)
);

// ▼医療保険診断用定数テーブル定義
$g_const_ir = array(
	'開始前期間分' => array(
		'支給あり' => 20,
		'支給なし' => 0
	),
	'支給開始日' => array(
		'1日目から' => 100,
		'4泊5日以上' => 100,
		'7泊8日以上' => 80,
		'20日以上' => 60
	),
	'特定疾病定数' => 50,
	'医療保険評価重み' => array(
		'継続性' => 0.4,
		'保険料支払負担' => 0.4,
		'保障の範囲' => 0.15,
		'給付の長さ' => 0.05
	)
);

// ▼デコードテーブル定義
$g_decode = array(
	'性別' => array(
		1 => '男',
		2 => '女'
	),
	'結婚' => array(
		1 => '既婚',
		2 => '独身'
	),
	'住宅' => array(
		1 => '持家',
		2 => '賃貸'
	),
	'住宅形態' => array(
		1 => '共同住宅（鉄筋）',
		2 => '共同住宅（木造）',
		3 => '戸建(鉄筋)',
		4 => '戸建(木造)'
	),
	'団信加入' => array(
		1 => '有',
		2 => '無'
	),
	'ローン名義' => array(
		1 => '本人',
		2 => '配偶者',
		3 => '共有',
		4 => 'その他親族'
	),
	'学校' => array(
		1 => '公',
		2 => '私',
		3 => '無'
	),
	'仕送り' => array(
		1 => '無',
		2 => '有'
	),
	'非喫煙' => array(
		1 => 'はい',
		2 => 'いいえ'
	),
	'健康' => array(
		1 => 'いいえ',
		2 => 'はい'
	),
	'運転' => array(
		1 => '自分の車を運転する',
		2 => '自分以外の車を運転する',
		3 => '運転しない'
	),
	'計算フラグ' => array(
		1 => '自動計算',
		2 => '手入力'
	),
	'所得基準' => array(
		1 => '年収',
		2 => '年収/12',
		3 => '標準報酬月額'
	),
	'給付形態' => array(
		1 => '定額',
		2 => '定率'
	),
	'60歳満了' => array(
		1 => '◎',
		2 => '定期'
	),
	'公的控除' => array(
		1 => '有',
		2 => '無'
	),
	'終身／定期' => array(
		1 => '終身',
		2 => '定期'
	),
	'保険料支払方法' => array(
		1 => '月払い',
		2 => '半年払い',
		3 => '年払い',
		4 => '一時払い'
	),
	'契約期間種別' => array(
		1 => '終身',
		2 => '定期（更新可）',
		3 => '定期（更新不可）'
	),
	'保険種別' => array(
		1 => '終身保険',
		2 => '変額終身保険',
		3 => '定期保険',
		4 => '定期保険（年金・月額型）',
		5 => 'グループ保険',
		6 => '逓減定期保険',
		7 => '養老保険',
		8 => '団体医療',
		9 => '医療保険',
		10 => 'ガン保険',
		11 => '個人年金保険',
		12 => '所得保障保険',
		13 => '団体傷害保険',
		14 => '普通傷害保険',
		15 => '交通事故傷害保険',
		16 => '積立傷害保険',
		17 => '積立交通事故傷害保険',
		18 => '学資保険',
		19 => '介護保険'
	),
	'非喫煙体割引' => array(
		1 => '活用',
		2 => '未活用'
	),
	'健康体割引' => array(
		1 => '活用',
		2 => '未活用'
	),
	'主契約者' => array(
		1 => '本人契約',
		2 => '配偶者への特約'
	),
	'主契約者死亡時家族契約継続' => array(
		1 => '契約消滅',
		2 => '契約者変更',
		3 => '保険料免除 '
	),
	'支給開始日' => array(
		1 => '1日目から',
		2 => '4泊5日以上',
		3 => '7泊8日以上',
		4 => '20日以上'
	),
	'開始前期間分' => array(
		1 => '支給あり',
		2 => '支給なし'
	),
	'損保保険種目' => array(
		1 => '火災',
		2 => '自動車',
		3 => '賠償責任',
		4 => 'その他'
	),
	'損保保険種別' => array(
		1 => '住宅火災保険',
		2 => '住宅総合保険',
		3 => '団地保険',
		4 => '自動車保険',
		5 => '個人賠償責任保険',
		6 => 'ゴルファー',
		7 => 'スキー・スケート',
		8 => 'その他'
	)
);

// エンコードテーブル作成
function make_encode_tbl() {
	global $g_decode;

	foreach ($g_decode as $name => $tbl) {
		foreach ($tbl as $code => $text)
			$encode[$name][$text] = "$code";
	}

	return $encode;
}
$g_encode = make_encode_tbl();
?>