//*****************************************************************************************************
//  1. ファイル名
//		MenuFS19.cpp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		検知スイッチ（機能スケマチック）画面の操作メニュー処理
//----------------------------------------------------------------------------------------------------
//  3. 備考
//*****************************************************************************************************

#include "stdafx.h"
#include "Schematic.h"
#include "MenuFS19.h"


// CMenuFS19 ダイアログ

IMPLEMENT_DYNCREATE(CMenuFS19, CMenuCommon)

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::CMenuFS19
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		コンストラクタ
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		CWnd*	pParent		[I] 親ウィンドウ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
CMenuFS19::CMenuFS19(CWnd* pParent /*=NULL*/)
	: CMenuCommon(CMenuFS19::IDD, pParent)
{
}

void CMenuFS19::DoDataExchange(CDataExchange* pDX)
{
	CMenuCommon::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_BUTTON_ACTION_1, m_cButtonAction1);
	DDX_Control(pDX, IDC_BUTTON_ACTION_2, m_cButtonAction2);
	DDX_Control(pDX, IDC_BUTTON_ACTION_3, m_cButtonAction3);
	DDX_Control(pDX, IDC_BUTTON_ACTION_4, m_cButtonAction4);
	DDX_Control(pDX, IDC_BUTTON_ACTION_5, m_cButtonAction5);
	DDX_Control(pDX, IDC_BUTTON_ACTION_6, m_cButtonAction6);
	DDX_Control(pDX, IDC_BUTTON_ACTION_7, m_cButtonAction7);
	DDX_Control(pDX, IDC_BUTTON_ACTION_8, m_cButtonAction8);
	DDX_Control(pDX, IDC_BUTTON_ACTION_9, m_cButtonAction9);
	DDX_Control(pDX, IDC_BUTTON_ACTION_10, m_cButtonAction10);
	DDX_Control(pDX, IDC_BUTTON_ACTION_11, m_cButtonAction11);
	DDX_Control(pDX, IDC_BUTTON_ACTION_12, m_cButtonAction12);
	DDX_Control(pDX, IDC_BUTTON_ACTION_13, m_cButtonAction13);
	DDX_Control(pDX, IDC_BUTTON_ACTION_14, m_cButtonAction14);
	DDX_Control(pDX, IDC_BUTTON_ACTION_15, m_cButtonAction15);
	DDX_Control(pDX, IDC_BUTTON_ACTION_16, m_cButtonAction16);
}


BEGIN_MESSAGE_MAP(CMenuFS19, CMenuCommon)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_1, &CMenuFS19::OnBnClickedButtonAction1)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_2, &CMenuFS19::OnBnClickedButtonAction2)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_3, &CMenuFS19::OnBnClickedButtonAction3)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_4, &CMenuFS19::OnBnClickedButtonAction4)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_5, &CMenuFS19::OnBnClickedButtonAction5)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_6, &CMenuFS19::OnBnClickedButtonAction6)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_7, &CMenuFS19::OnBnClickedButtonAction7)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_8, &CMenuFS19::OnBnClickedButtonAction8)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_9, &CMenuFS19::OnBnClickedButtonAction9)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_10, &CMenuFS19::OnBnClickedButtonAction10)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_11, &CMenuFS19::OnBnClickedButtonAction11)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_12, &CMenuFS19::OnBnClickedButtonAction12)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_13, &CMenuFS19::OnBnClickedButtonAction13)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_14, &CMenuFS19::OnBnClickedButtonAction14)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_15, &CMenuFS19::OnBnClickedButtonAction15)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_16, &CMenuFS19::OnBnClickedButtonAction16)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_17, &CMenuFS19::OnBnClickedButtonAction17)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_18, &CMenuFS19::OnBnClickedButtonAction18)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_19, &CMenuFS19::OnBnClickedButtonAction19)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_20, &CMenuFS19::OnBnClickedButtonAction20)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_21, &CMenuFS19::OnBnClickedButtonAction21)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_22, &CMenuFS19::OnBnClickedButtonAction22)
END_MESSAGE_MAP()


// CMenuFS19 メッセージ ハンドラ

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnInitDialog
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ダイアログ初期化処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL	TRUE
//*****************************************************************************************************
BOOL CMenuFS19::OnInitDialog()
{
	CMenuCommon::OnInitDialog();

	// 動作ステータス設定
	SetStatus(STATUS_INITIAL);

	return FALSE;
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction1
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「スタート」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction1()
{
	// 動作ステータス設定
	SetStatus(STATUS_WORKING);

	// Flashへ操作指示送信
	SendAction(ACTION_1);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction2
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「温度スイッチ：正常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction2()
{
	// Flashへ操作指示送信
	SendAction(ACTION_2);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction3
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「温度スイッチ：異常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction3()
{
	// Flashへ操作指示送信
	SendAction(ACTION_3);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction4
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「圧力スイッチ：正常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction4()
{
	// Flashへ操作指示送信
	SendAction(ACTION_4);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction5
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「圧力スイッチ：異常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction5()
{
	// Flashへ操作指示送信
	SendAction(ACTION_5);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction6
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「ﾌｨﾙﾀ(ﾌﾟﾚｯｼｬ)ｽｲｯﾁ：正常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction6()
{
	// Flashへ操作指示送信
	SendAction(m_cButtonAction8 ? ACTION_6 : ACTION_7);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction7
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「ﾌｨﾙﾀ(ﾌﾟﾚｯｼｬ)ｽｲｯﾁ：異常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction7()
{
	// Flashへ操作指示送信
	SendAction(m_cButtonAction8 ? ACTION_8 : ACTION_9);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction8
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「ﾌｨﾙﾀ(ﾘﾀｰﾝ)ｽｲｯﾁ：正常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction8()
{
	// Flashへ操作指示送信
	SendAction(m_cButtonAction6 ? ACTION_6 : ACTION_8);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction9
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「ﾌｨﾙﾀ(ﾘﾀｰﾝ)ｽｲｯﾁ：異常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction9()
{
	// Flashへ操作指示送信
	SendAction(m_cButtonAction6 ? ACTION_7 : ACTION_9);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction10
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「油量低下スイッチ：正常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction10()
{
	// Flashへ操作指示送信
	SendAction(ACTION_10);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction11
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「油量低下スイッチ：異常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction11()
{
	// Flashへ操作指示送信
	SendAction(ACTION_11);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction12
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「モータ高温スイッチ：正常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction12()
{
	// Flashへ操作指示送信
	SendAction(ACTION_12);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction13
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「モータ高温スイッチ：異常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction13()
{
	// Flashへ操作指示送信
	SendAction(ACTION_13);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction14
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「プレッシャスイッチ：正常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction14()
{
	// Flashへ操作指示送信
	SendAction(ACTION_14);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction15
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「プレッシャスイッチ：異常」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction15()
{
	// Flashへ操作指示送信
	SendAction(ACTION_15);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction16
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「高低位置検出器」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction16()
{
	SendAction(ACTION_16);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction17
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「方位位置検出器」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction17()
{
	SendAction(ACTION_17);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction18
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「右」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction18()
{
	SendAction(ACTION_18);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction19
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「左」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction19()
{
	SendAction(ACTION_19);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction20
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「上」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction20()
{
	SendAction(ACTION_20);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction21
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「下」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction21()
{
	SendAction(ACTION_21);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::OnBnClickedButtonAction22
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「リセット」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::OnBnClickedButtonAction22()
{
	// 動作ステータス設定
	SetStatus(STATUS_INITIAL);

	// Flashへ操作指示送信
	SendAction(ACTION_22);
}


//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::SetStatus
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		動作ステータス設定処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		EStatus		eStatus		[I] 設定ステータス
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::SetStatus(EStatus eStatus)
{
	// 動作ステータス設定
	m_eStatus = eStatus;

	// メニューボタン設定
	SetMenuButton();
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::ActionEnd
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		Flashからの動作終了通知受信処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		int		nActionNo		[I] アクション番号
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::ActionEnd(int nActionNo)
{
	switch (nActionNo) {
	case ACTION_1:
		SetStatus(STATUS_ENABLE);
		break;
	}
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS19::SetMenuButton
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		メニューボタン設定処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS19::SetMenuButton()
{
	switch (m_eStatus) {
	case STATUS_INITIAL:		// 初期状態
		m_cButtonAction1.SetEnableAndCheck(TRUE, FALSE);
		m_cButtonAction2.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction3.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction4.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction5.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction6.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction7.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction8.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction9.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction10.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction11.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction12.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction13.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction14.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction15.SetEnableAndCheck(FALSE, FALSE);
		break;
	case STATUS_WORKING:		// スタートボタン動作中
		m_cButtonAction1.SetEnableAndCheck(FALSE, TRUE);
		m_cButtonAction2.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction3.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction4.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction5.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction6.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction7.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction8.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction9.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction10.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction11.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction12.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction13.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction14.SetEnableAndCheck(FALSE, FALSE);
		m_cButtonAction15.SetEnableAndCheck(FALSE, FALSE);
		break;
	case STATUS_ENABLE:		// 検知スイッチ有効
		m_cButtonAction1.SetEnableAndCheck(FALSE, TRUE);
		m_cButtonAction2.SetEnableAndCheck(TRUE, TRUE);
		m_cButtonAction3.SetEnableAndCheck(TRUE, FALSE);
		m_cButtonAction4.SetEnableAndCheck(TRUE, TRUE);
		m_cButtonAction5.SetEnableAndCheck(TRUE, FALSE);
		m_cButtonAction6.SetEnableAndCheck(TRUE, TRUE);
		m_cButtonAction7.SetEnableAndCheck(TRUE, FALSE);
		m_cButtonAction8.SetEnableAndCheck(TRUE, TRUE);
		m_cButtonAction9.SetEnableAndCheck(TRUE, FALSE);
		m_cButtonAction10.SetEnableAndCheck(TRUE, TRUE);
		m_cButtonAction11.SetEnableAndCheck(TRUE, FALSE);
		m_cButtonAction12.SetEnableAndCheck(TRUE, TRUE);
		m_cButtonAction13.SetEnableAndCheck(TRUE, FALSE);
		m_cButtonAction14.SetEnableAndCheck(TRUE, FALSE);
		m_cButtonAction15.SetEnableAndCheck(TRUE, TRUE);
		break;
	}
}
