//*****************************************************************************************************
//  1. ファイル名
//		MenuFS12.cpp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ＬＰ／Ｃ－弾頭連接器画面の操作メニュー処理
//----------------------------------------------------------------------------------------------------
//  3. 備考
//*****************************************************************************************************

#include "stdafx.h"
#include "Schematic.h"
#include "MenuFS12.h"


// CMenuFS12 ダイアログ

IMPLEMENT_DYNCREATE(CMenuFS12, CMenuCommon)

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::CMenuFS12
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		コンストラクタ
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		CWnd*	pParent		[I] 親ウィンドウ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
CMenuFS12::CMenuFS12(CWnd* pParent /*=NULL*/)
	: CMenuCommon(CMenuFS12::IDD, pParent)
{
}

void CMenuFS12::DoDataExchange(CDataExchange* pDX)
{
	CMenuCommon::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_BUTTON_ACTION_1, m_cButtonAction1);
	DDX_Control(pDX, IDC_BUTTON_ACTION_2, m_cButtonAction2);
	DDX_Control(pDX, IDC_BUTTON_ACTION_3, m_cButtonAction3);
	DDX_Control(pDX, IDC_BUTTON_ACTION_4, m_cButtonAction4);
}


BEGIN_MESSAGE_MAP(CMenuFS12, CMenuCommon)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_1, &CMenuFS12::OnBnClickedButtonAction1)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_2, &CMenuFS12::OnBnClickedButtonAction2)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_3, &CMenuFS12::OnBnClickedButtonAction3)
	ON_BN_CLICKED(IDC_BUTTON_ACTION_4, &CMenuFS12::OnBnClickedButtonAction4)
END_MESSAGE_MAP()


// CMenuFS12 メッセージ ハンドラ

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::OnInitDialog
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ダイアログ初期化処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL	TRUE
//*****************************************************************************************************
BOOL CMenuFS12::OnInitDialog()
{
	CMenuCommon::OnInitDialog();

	// 動作中フラグリセット
	m_bWorking = FALSE;

	// 動作ステータス設定
	SetStatus(STATUS_POWER_OFF, STATUS_PANEL_OFF);

	return TRUE;
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::OnBnClickedButtonAction1
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「電源併入　切」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS12::OnBnClickedButtonAction1()
{
	// 動作ステータス設定
	SetStatus(STATUS_POWER_OFF, STATUS_PANEL_OFF);

	// Flashへ操作指示送信
	SendAction(ACTION_4);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::OnBnClickedButtonAction2
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「電源併入　入」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS12::OnBnClickedButtonAction2()
{
	// 動作中フラグセット
	m_bWorking = TRUE;

	// 動作ステータス設定
	SetStatus(STATUS_POWER_ON, m_ePanelStatus);

	// Flashへ操作指示送信
	SendAction(ACTION_1);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::OnBnClickedButtonAction3
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「パネル電源　ＯＦＦ」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS12::OnBnClickedButtonAction3()
{
	// 動作ステータス設定
	SetStatus(m_ePowerStatus, STATUS_PANEL_OFF);

	// Flashへ操作指示送信
	SendAction(3);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::OnBnClickedButtonAction4
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		「パネル電源　ＯＮ」ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS12::OnBnClickedButtonAction4()
{
	// 動作中フラグセット
	m_bWorking = TRUE;

	// 動作ステータス設定
	SetStatus(m_ePowerStatus, STATUS_PANEL_ON);

	// Flashへ操作指示送信
	SendAction(2);
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::ActionEnd
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		Flashからの動作終了通知受信処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		int		nActionNo		[I] アクション番号
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS12::ActionEnd(int nActionNo)
{
	if (m_bWorking) {
		// 動作中フラグリセット
		m_bWorking = FALSE;

		// メニューボタン設定
		SetMenuButton();
	}
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::SetStatus
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		動作ステータス設定処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		EPanelStatus	ePanelStatus		[I] 射撃統制パネル電源動作ステータス
//		EPowerStatus	ePowerStatus		[I] 電源併入動作ステータス
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS12::SetStatus(EPowerStatus ePowerStatus, EPanelStatus ePanelStatus)
{
	// 動作ステータス設定
	m_ePowerStatus = ePowerStatus;
	m_ePanelStatus = ePanelStatus;

	// メニューボタン設定
	SetMenuButton();
}

//*****************************************************************************************************
//  1. 関数名
//		CMenuFS12::SetMenuButton
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		メニューボタン設定処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CMenuFS12::SetMenuButton()
{
	switch (m_ePowerStatus) {
	case STATUS_POWER_OFF:
		m_cButtonAction1.SetEnableAndCheck(FALSE, TRUE);
		m_cButtonAction2.SetEnableAndCheck(TRUE, FALSE);
		break;
	case STATUS_POWER_ON:
		m_cButtonAction1.SetEnableAndCheck(m_ePanelStatus == STATUS_PANEL_OFF, FALSE);
		m_cButtonAction2.SetEnableAndCheck(FALSE, TRUE);
		break;
	}

	switch (m_ePanelStatus) {
	case STATUS_PANEL_OFF:
		m_cButtonAction3.SetEnableAndCheck(FALSE, TRUE);
		m_cButtonAction4.SetEnableAndCheck(m_ePowerStatus == STATUS_POWER_ON, FALSE);
		break;
	case STATUS_PANEL_ON:
		m_cButtonAction3.SetEnableAndCheck(m_ePowerStatus == STATUS_POWER_ON, FALSE);
		m_cButtonAction4.SetEnableAndCheck(FALSE, TRUE);
		break;
	}

	if (m_bWorking) {
		m_cButtonAction1.SetEnable(FALSE);
		m_cButtonAction2.SetEnable(FALSE);
		m_cButtonAction3.SetEnable(FALSE);
		m_cButtonAction4.SetEnable(FALSE);
	}
}
