//*****************************************************************************************************
//  1. ファイル名
//		SchematicFrm.cpp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		接続系統図・機能系統図・機能説明図のFlash表示用フレームウィンドウ処理
//----------------------------------------------------------------------------------------------------
//  3. 備考
//*****************************************************************************************************

#include "stdafx.h"
#include "Schematic.h"
#include "SchematicFrm.h"

#ifdef _DEBUG
#define new DEBUG_NEW
#endif


// CSchematicFrame

IMPLEMENT_DYNAMIC(CSchematicFrame, CFrameWnd)

BEGIN_MESSAGE_MAP(CSchematicFrame, CFrameWnd)
	ON_WM_CREATE()
	ON_WM_DESTROY()
	ON_WM_CLOSE()
END_MESSAGE_MAP()

static UINT indicators[] =
{
	ID_SEPARATOR,           // ステータス ライン インジケータ
	ID_INDICATOR_CAPS,
	ID_INDICATOR_NUM,
	ID_INDICATOR_SCRL,
};

//*****************************************************************************************************
//  1. 関数名
//		CSchematicFrame::CreateFrameWindow
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		フレームウィンドウを作成
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		int		nActionCode			[I] アクションコード
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CSchematicFrame::CreateFrameWindow(int nActionCode)
{
	GetSchematicInfo();

	// デスクトップのサイズを取得
	CRect rect;
	::SystemParametersInfo(SPI_GETWORKAREA, 0, rect, 0);

	// デスクトップより10ピクセル小さく表示する
	rect.DeflateRect(10, 10);

	// フレームウィンドウを作成する
	if (!Create(AfxRegisterWndClass(0, 0, 0, AfxGetApp()->LoadIcon(IDR_MAINFRAME)), m_sWindowTitle, WS_OVERLAPPEDWINDOW | WS_VISIBLE, rect, AfxGetMainWnd(), NULL, 0L))
		return;

	// メインウィンドウのポインタを設定
	if (AfxGetApp()->m_pMainWnd == NULL)
		AfxGetApp()->m_pMainWnd = this;

	m_pWndView->ShowSchematic(m_pMenuClass, m_sFlashFileName, nActionCode);
}

//*****************************************************************************************************
//  1. 関数名
//		CSchematicFrame::PreCreateWindow
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		フレームウィンドウ作成前処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		CREATESTRUCT&		cs			[I] ウィンドウ初期化パラメータ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL	TRUE
//*****************************************************************************************************
BOOL CSchematicFrame::PreCreateWindow(CREATESTRUCT& cs)
{
	if( !CFrameWnd::PreCreateWindow(cs) )
		return FALSE;

	// WS_EX_CLIENTEDGEスタイルを削除
	cs.dwExStyle &= ~WS_EX_CLIENTEDGE;

	return TRUE;
}

//*****************************************************************************************************
//  1. 関数名
//		CSchematicFrame::OnCreate
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		フレームウィンドウ作成時処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		LPCREATESTRUCT		lpCreateStruct			[I] ウィンドウ初期化パラメータ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		int		0
//*****************************************************************************************************
int CSchematicFrame::OnCreate(LPCREATESTRUCT lpCreateStruct)
{
	if (CFrameWnd::OnCreate(lpCreateStruct) == -1)
		return -1;

	// ビューウィンドウを作成
	m_pWndView = (CSchematicView *)m_pViewClass->CreateObject();
	if (!m_pWndView->Create(NULL, NULL, AFX_WS_DEFAULT_VIEW | WS_CLIPCHILDREN, CRect(0, 0, 0, 0), this, AFX_IDW_PANE_FIRST, NULL))
		return -1;

	// ステータスバーを作成
	if (!m_wndStatusBar.Create(this) || !m_wndStatusBar.SetIndicators(indicators, sizeof(indicators)/sizeof(UINT)))
		return -1;      // 作成できませんでした。

	return 0;
}


// CSchematicFrame メッセージ ハンドラ

//*****************************************************************************************************
//  1. 関数名
//		CSchematicFrame::OnDestroy
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		フレームウィンドウ破棄処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CSchematicFrame::OnDestroy()
{
	CFrameWnd::OnDestroy();

	// メインウィンドウを前面に表示させる
	AfxGetMainWnd()->SetForegroundWindow();
	AfxGetMainWnd()->UpdateWindow();
}

//*****************************************************************************************************
//  1. 関数名
//		CSchematicFrame::GetSchematicInfo
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		図表ウィンドウデータ取得
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CSchematicFrame::GetSchematicInfo()
{
	SSchematicWindow *pSchematicWindow = m_lSchematicWindow.RemoveHead();

	// 図表リストからデータをメンバ変数に設定する
	m_sWindowTitle = pSchematicWindow->sWindowTitle;
	m_sFlashFileName = pSchematicWindow->sFlashFileName;
	m_pMenuClass = pSchematicWindow->pMenuClass;
	m_pViewClass = pSchematicWindow->pViewClass;
}

//*****************************************************************************************************
//  1. 関数名
//		CSchematicFrame::OnClose
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ウィンドウクローズ処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CSchematicFrame::OnClose()
{
	if (m_lSchematicWindow.IsEmpty()) {
		// 図表リストが空ならウィンドウを閉じる
		CFrameWnd::OnClose();
	} else {
		// 図表リストが空でなければ次の図表を表示する
		GetSchematicInfo();
		SetWindowText(m_sWindowTitle);
		m_pWndView->ShowSchematic(m_pMenuClass, m_sFlashFileName, 0);
	}
}
