//*****************************************************************************************************
//  1. ファイル名
//		AboutDlg.cpp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		アバウトダイアログクラスの実装
//----------------------------------------------------------------------------------------------------
//  3. 備考
//		無し
//*****************************************************************************************************

#include "stdafx.h"
#include "MmeRecv.h"
#include "AboutDlg.h"


// CAboutDlg ダイアログ

IMPLEMENT_DYNAMIC(CAboutDlg, CDialog)

//*****************************************************************************************************
//  1. 関数名
//		CAboutDlg::CAboutDlg
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		コンストラクタ
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CWnd		*pParent			[I] 親ウィンドウポインタ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
CAboutDlg::CAboutDlg(CWnd* pParent /*=NULL*/)
	: CDialog(CAboutDlg::IDD, pParent)
{
	CString sVersion;
	sVersion.LoadString(IDS_VERSION);
	m_sStaticProgramName.Format("MmeRecv Version %s", sVersion);
}

void CAboutDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	DDX_Text(pDX, IDC_STATIC_PROGRAM_NAME, m_sStaticProgramName);
}


BEGIN_MESSAGE_MAP(CAboutDlg, CDialog)
END_MESSAGE_MAP()


// CAboutDlg メッセージ ハンドラ
