#pragma once
//*****************************************************************************************************
//  1. ファイル名
//		AboutDlg.h
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		アバウトダイアログクラスの定義
//----------------------------------------------------------------------------------------------------
//  3. 備考
//		無し
//*****************************************************************************************************

class CAboutDlg : public CDialog
{
	DECLARE_DYNAMIC(CAboutDlg)

public:
	CAboutDlg(CWnd* pParent = NULL);   // 標準コンストラクタ

// ダイアログ データ
	enum { IDD = IDD_ABOUTBOX };

protected:
	virtual void DoDataExchange(CDataExchange* pDX);    // DDX/DDV サポート

	CString m_sStaticProgramName;

	DECLARE_MESSAGE_MAP()
};
