//*****************************************************************************************************
//  1. ファイル名
//		General.cpp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		汎用関数クラスの実装
//----------------------------------------------------------------------------------------------------
//  3. 備考
//		無し
//*****************************************************************************************************

#include "StdAfx.h"
#include "General.h"
#include <shlwapi.h>

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::Alert
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		アラートメッセージを表示する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR		pMessage			[I] 表示するメッセージ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::Alert(LPCTSTR pMessage, ...)
{
	va_list args;
	va_start(args, pMessage);

	CString sMessage;
	sMessage.FormatV(pMessage, args);

	CWnd::GetActiveWindow()->MessageBox(sMessage, NULL, MB_OK | MB_ICONEXCLAMATION | MB_SYSTEMMODAL);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::GetIniPathName
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		iniファイルの絶対パスを取得する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CString		&sIniPathName			[O] iniファイルパス
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::GetIniPathName(CString &sIniPathName)
{
	static const char aIniFileName[] = "mme.ini";

	TCHAR szPath[_MAX_PATH];
	::GetModuleFileName(NULL, szPath, sizeof(szPath) / sizeof(TCHAR));
	::PathRemoveFileSpec(szPath);
	sIniPathName.Format("%s\\%s", szPath, aIniFileName);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::GetPrivateProfileDouble
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		iniファイルからdouble型のデータを取得する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR		pSession			[I] セッション名
//		LPCTSTR		pKey				[I] キー名
//		double		fDefault			[I] デフォルト値
//		LPCTSTR		pIniPathName		[I] iniファイル名
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		double		取得したdouble値
//*****************************************************************************************************
double CGeneral::GetPrivateProfileDouble(LPCTSTR pSession, LPCTSTR pKey, double fDefault, LPCTSTR pIniPathName)
{
	CString sDefault;
	sDefault.Format("%g", fDefault);

	char buf[256];
	::GetPrivateProfileString(pSession, pKey, sDefault, buf, sizeof(buf), pIniPathName);
	return atof(buf);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::WritePrivateProfileInt
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		iniファイルにint型のデータを書き込む
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR		pSession			[I] セッション名
//		LPCTSTR		pKey				[I] キー名
//		int			nData				[I] 書き込む値
//		LPCTSTR		pIniPathName		[I] iniファイル名
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::WritePrivateProfileInt(LPCTSTR pSession, LPCTSTR pKey, int nData, LPCTSTR pIniPathName)
{
	CString sData;
	sData.Format("%d", nData);
	::WritePrivateProfileString(pSession, pKey, sData, pIniPathName);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::WritePrivateProfileDouble
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		iniファイルにdouble型のデータを書き込む
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR		pSession			[I] セッション名
//		LPCTSTR		pKey				[I] キー名
//		double		fData				[I] 書き込む値
//		LPCTSTR		pIniPathName		[I] iniファイル名
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::WritePrivateProfileDouble(LPCTSTR pSession, LPCTSTR pKey, double fData, LPCTSTR pIniPathName)
{
	CString sData;
	sData.Format("%g", fData);
	::WritePrivateProfileString(pSession, pKey, sData, pIniPathName);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::StrSplit
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		セパレータで区切られた文字列を分解して配列にセットする
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR			pText			[I] 文字列
//		LPCTSTR			pSeparator		[I] セパレータ
//		CStringArray	&saText			[O] 文字列配列
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::StrSplit(LPCTSTR pText, LPCTSTR pSeparator, CStringArray &saText)
{
	saText.RemoveAll();

	int nPos= 0;
	CString sText(pText);
	CString sToken = sText.Tokenize(pSeparator, nPos);

	while (sToken != "") {
		saText.Add(sToken);
		sToken = sText.Tokenize(pSeparator, nPos);
	}
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::StrJoin
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		文字列配列をセパレータで連結する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CStringArray	&saText			[I] 文字列配列
//		LPCTSTR			pSeparator		[I] セパレータ
//		CString			&sText			[O] 連結した文字列
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::StrJoin(const CStringArray &saText, LPCTSTR pSeparator, CString &sText)
{
	sText.Empty();

	for (int i = 0; i < saText.GetSize(); i++) {
		if (i != 0)
			sText += pSeparator;

		sText += saText[i];
	}
}
