/************************************************************************
 *									*
 *		Ｓ／Ｇ　ＣＰＵプログラム				*
 *									*
 *		名称		: ＲＯＭデータ				*
 *		ファイル名	: romdata.c				*
 *									*
 ************************************************************************/
#include "sg_cpu.h"

/*	数値－フォント４アドレス変換テーブル */
word	numfont4_tbl[10] = {
	FONT_T40,		/* 0 */
	FONT_T41,		/* 1 */
	FONT_T42,		/* 2 */
	FONT_T43,		/* 3 */
	FONT_T44,		/* 4 */
	FONT_T45,		/* 5 */
	FONT_T46,		/* 6 */
	FONT_T47,		/* 7 */
	FONT_T48,		/* 8 */
	FONT_T49		/* 9 */
};

/*	数値－フォント５アドレス変換テーブル */
word	numfont5_tbl[10] = {
	FONT_T50,		/* 0 */
	FONT_T51,		/* 1 */
	FONT_T52,		/* 2 */
	FONT_T53,		/* 3 */
	FONT_T54,		/* 4 */
	FONT_T55,		/* 5 */
	FONT_T56,		/* 6 */
	FONT_T57,		/* 7 */
	FONT_T58,		/* 8 */
	FONT_T59		/* 9 */
};
