//*****************************************************************************************************
//  1. ファイル名
//		ConvAsuDlg.cpp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ASUデータファイル読み込みダイアログクラスの実装
//----------------------------------------------------------------------------------------------------
//  3. 備考
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 履歴
//		2016.02.01 S.Aizawa 新規作成
//*****************************************************************************************************

#include "stdafx.h"
#include "MMA_G.h"
#include "ConvAsuDlg.h"
#include "General.h"


// CConvAsuDlg ダイアログ

IMPLEMENT_DYNAMIC(CConvAsuDlg, CDialog)

CConvAsuDlg::CConvAsuDlg(CWnd* pParent /*=NULL*/)
	: CDialog(CConvAsuDlg::IDD, pParent)
{

}

CConvAsuDlg::~CConvAsuDlg()
{
}

void CConvAsuDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_EDIT_DATA_FILE, m_cEditDataFile);
	DDX_Control(pDX, IDC_EDIT_START_TIME, m_cEditStartTime);
	DDX_Control(pDX, IDC_EDIT_END_TIME, m_cEditEndTime);
	DDX_Control(pDX, IDC_EDIT_MEAS_TIME, m_cEditMeasTime);
	DDX_Control(pDX, IDC_EDIT_DOWNLINK, m_cEditDownlink);
	DDX_Control(pDX, IDC_EDIT_COMMENT, m_cEditComment);
	DDX_Control(pDX, IDC_EDIT_SAMPLE_RATE, m_cEditSampleRate);
	DDX_Control(pDX, IDC_BUTTON_REF, m_cButtonRef);
	DDX_Control(pDX, IDC_BUTTON_CONV, m_cButtonConv);
	DDX_Control(pDX, IDCANCEL, m_cButtonCancel);
}


BEGIN_MESSAGE_MAP(CConvAsuDlg, CDialog)
	ON_BN_CLICKED(IDC_BUTTON_REF, &CConvAsuDlg::OnBnClickedButtonRef)
	ON_BN_CLICKED(IDC_BUTTON_CONV, &CConvAsuDlg::OnBnClickedButtonConv)
END_MESSAGE_MAP()

// ツールチップ表示データ
static const SToolTipData s_aToolTip[] = {
	{IDC_BUTTON_REF, "ASUデータファイルを選択するためのダイアログを開きます。"},
	{IDC_BUTTON_CONV, "設定された内容で、ASUデータファイルの読み込みを実行します。"},
	{IDCANCEL, "このダイアログを閉じます。"},
	{0, NULL}
};

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::ShowDialog
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ASUデータファイル読み込みダイアログ表示
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CDocument	*pDoc		[I] ドキュメントクラスポインタ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CConvAsuDlg::ShowDialog(CDocument *pDoc)
{
	m_pDoc = pDoc;

	DoModal();
}

// CConvAsuDlg メッセージ ハンドラ

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::OnInitDialog
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ダイアログ初期化処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL	TRUE
//*****************************************************************************************************
BOOL CConvAsuDlg::OnInitDialog()
{
	CDialog::OnInitDialog();

	// ツールチップ表示設定
	CGeneral::SetToolTip(m_tooltip, s_aToolTip, this);

	return TRUE;
}

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::OnBnClickedButtonRef
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ASUデータファイルの参照ボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CConvAsuDlg::OnBnClickedButtonRef()
{
	CFileDialog dlg(TRUE, "csv", NULL, OFN_HIDEREADONLY, _T("ASUデータファイル (*.csv)|*.csv||"));
	if (dlg.DoModal() == IDOK) {
		CString sDataFile = dlg.GetPathName();
		m_cEditDataFile = sDataFile;

		if (!CheckDataFile(sDataFile))
			m_cEditDataFile = "";
	}

	// 変換ボタン有効化
	EnableConvButton();
}

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::CheckDataFile
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		選択したフォルダのチェック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR		pDataFile		[I] 選択したファイル
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL	TRUE：正常　FALSE:エラー
//*****************************************************************************************************
BOOL CConvAsuDlg::CheckDataFile(LPCTSTR pDataFile)
{
	double fSampleRate;
	CDataDateTime oStartTime, oEndTime;
	int nMeasTime;

	// ASUデータファイルチェック
	if (m_oAsuFile.CheckDataFile(pDataFile, fSampleRate, oStartTime, oEndTime, nMeasTime)) {
		// サンプリングレート表示
		m_cEditSampleRate.Format("%g", fSampleRate);

		// 開始時刻表示
		m_cEditStartTime = oStartTime.GetStr();

		// 終了時刻表示
		m_cEditEndTime = oEndTime.GetStr();

		// 計測時間表示
		CString sMeasTime;
		sMeasTime.Format("%dhours  %02dmin  %02dsec", nMeasTime / 3600, nMeasTime / 60 % 60, nMeasTime % 60);
		m_cEditMeasTime = sMeasTime;

		// ダウンリンク日表示
		// 開始時刻の日付をデフォルトで表示する
//		m_cEditDownlink = oStartTime.GetStrYMDHMS();
		m_cEditDownlink = oStartTime.GetStrYMD();

		return TRUE;
	} else
		return FALSE;
}

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::OnBnClickedButtonConv
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ファイル読み込みボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CConvAsuDlg::OnBnClickedButtonConv()
{
	// 変換済みファイル存在チェック
	if (m_oAsuFile.m_bOverWrite) {
		if (AfxMessageBox("この変換データは既に存在します。このまま読み込み処理を行うと，既存データが上書きされます。\n読み込み処理を継続しますか？",MB_ICONQUESTION|MB_YESNO) == IDNO)
			return;
	}

	// 実行確認
	if (AfxMessageBox("読み込み処理を実行しますか？", MB_YESNO) != IDYES)
		return;

	// 入力データセット
	m_oAsuFile.m_sDownlink = m_cEditDownlink;
	m_oAsuFile.m_sComment = m_cEditComment;

	// ボタンを無効にする
	KeyOff();

	// バイナリ変換処理
	BOOL nResult = m_oAsuFile.ConvDataFile();

	// ビューを更新
	m_pDoc->UpdateAllViews(NULL);

	if (nResult) {
		// 変換終了メッセージ表示
		AfxMessageBox("読み込み処理が終了しました", MB_ICONINFORMATION | MB_OK);
	} else {
		// 変換中止メッセージ表示
		AfxMessageBox("読み込み処理を中止しました", MB_ICONINFORMATION | MB_OK);
	}

	// ボタンを有効にする
	KeyOn();
}

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::OnOK
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		OKボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CConvAsuDlg::OnOK()
{
	// 何もしない（Enterキーで閉じないようにする）
}

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::EnableConvButton
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		工学値変換ボタンの有効／無効を設定する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CConvAsuDlg::EnableConvButton()
{
	BOOL bEnable = TRUE;

	// データフォルダ入力チェック
	if (m_cEditDataFile.IsEmpty())
		bEnable = FALSE;

	// ダウンリンク日入力チェック
	if (m_cEditDownlink.IsEmpty())
		bEnable = FALSE;

	// 変換ボタンを有効／無効に設定
	m_cButtonConv.EnableWindow(bEnable);
}

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::KeyOff
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		処理中にボタンをGRAYにする
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CConvAsuDlg::KeyOff(void)
{
	m_cButtonConv.EnableWindow(FALSE);
	m_cButtonCancel.EnableWindow(FALSE);
	m_cButtonRef.EnableWindow(FALSE);
}

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::KeyOn
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ボタンのGRAYを解除する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CConvAsuDlg::KeyOn(void)
{
	EnableConvButton();
	m_cButtonCancel.EnableWindow(TRUE);
	m_cButtonRef.EnableWindow(TRUE);
}

//*****************************************************************************************************
//  1. 関数名
//		CConvAsuDlg::PreTranslateMessage
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ウィンドウメッセージ処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		MSG*	pMsg			[I] MSG構造体へのポインタ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL	親クラスの返値をそのまま返す
//*****************************************************************************************************
BOOL CConvAsuDlg::PreTranslateMessage(MSG* pMsg)
{
	// ツールチップを表示するための処理
	switch(pMsg->message){
	case WM_LBUTTONDOWN:            
	case WM_LBUTTONUP:              
	case WM_MOUSEMOVE:
		if (m_tooltip.m_hWnd)
			m_tooltip.RelayEvent(pMsg);
		break;
	}

	return CDialog::PreTranslateMessage(pMsg);
}
