//*****************************************************************************************************
//  1. ファイル名
//		General.cpp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		汎用関数クラスの実装
//----------------------------------------------------------------------------------------------------
//  3. 備考
//----------------------------------------------------------------------------------------------------
//  4. 履歴
//		2007.08.09 S.Aizawa 新規作成
//*****************************************************************************************************

#include "StdAfx.h"
#include "General.h"
#include "DigitalFilter.h"
#include "GlobalData.h"
#include <math.h>
#include <direct.h>
#include <io.h>

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::FormatTime
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ミリ秒単位の数値から"HH:MM:SS.999"形式に変換
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		double		fSecond			[I] 秒数
//		int			nDecimal		[I] ミリ秒以下の桁数
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		CString		変換した文字列
//*****************************************************************************************************
CString CGeneral::FormatTime(double fSecond, int nDecimal)
{
	CString sText;

	int nDigit = 1;
	for (int i = 0; i < nDecimal; i++)
		nDigit *= 10;

	int nMiliSecond = (int)(fSecond * nDigit + 0.5);
	int nHour = nMiliSecond / (60 * 60 * nDigit);
	nMiliSecond -= nHour * (60 * 60 * nDigit);

	int nMinute = nMiliSecond / (60 * nDigit);
	nMiliSecond -= nMinute * (60 * nDigit);

	int nSecond = nMiliSecond / nDigit;
	nMiliSecond -= nSecond * nDigit;

	if (nHour >= 24)
		nHour = nHour % 24;

	if (nDecimal) {
		CString sFormat;
		sFormat.Format("%%02d:%%02d:%%02d.%%0%dd", nDecimal);
		sText.Format(sFormat, nHour, nMinute, nSecond, nMiliSecond);
	} else
		sText.Format("%02d:%02d:%02d", nHour, nMinute, nSecond);

	return sText;
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::Alert
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		アラートメッセージ表示
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR		pMessage			[I] 表示するメッセージ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::Alert(LPCTSTR pMessage, ...)
{
	va_list args;
	va_start(args, pMessage);

	CString sMessage;
	sMessage.FormatV(pMessage, args);

	CWnd::GetActiveWindow()->MessageBox(sMessage, NULL, MB_OK | MB_ICONEXCLAMATION | MB_SYSTEMMODAL);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::SetSampleRateList
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		サンプリング周波数のコンボボックスを設定
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CComboBox		&cComboBox			[O] コンボボックス
//		double			fSampleRate			[I] サンプリング周波数
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::SetSampleRateList(CComboBox &cComboBox, double fSampleRate)
{
	CString sText;

	// サンプリング周波数のコンボボックスを設定
	int nDiv = 1;
	// 間引き表示は，1/1，1/2，1/4で間引く
	for (int i = 0; i < 3; i++) {
		sText.Format("1/%d", nDiv);
		cComboBox.SetItemData(cComboBox.AddString(sText), nDiv);

		nDiv *= 2;
	}

	cComboBox.SetCurSel(0);
}		

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::DelDir
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		指定フォルダ内に存在するファイル全てを削除する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCSTR		path			[I] 指定フォルダ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		bool	true：成功　false：失敗
//*****************************************************************************************************
bool CGeneral::DelDir(LPCSTR path)
{
	char wpath[MAX_PATH];
	struct _finddata_t c_file;
    intptr_t hFile;
	CString	str;

	memset(wpath, 0, sizeof(wpath));
	strcpy_s(wpath, path);
	strcat_s(wpath, "\\*.*");

    /* カレント ディレクトリ内の最初のフォルダを探します。*/
	if( (hFile = _findfirst(wpath, &c_file )) != -1L ) {
		// フォルダ？
		if (c_file.attrib & _A_SUBDIR) {
			if (c_file.name[0] != '.') {
				str.Format("%s\\%s", path, c_file.name);
				if (! DelDir((LPCSTR)str)) {
					_findclose( hFile );
					return false;
				}
			}
		} else {
			str.Format("%s\\%s", path, c_file.name);
			if (remove((LPCSTR)str) == -1) {
				_findclose( hFile );
				return false;
			}
		}
		/* 残りのフォルダを探します。 */
		while( _findnext( hFile, &c_file ) == 0 ) {
			// フォルダ？
			if (c_file.attrib & _A_SUBDIR) {
				if (c_file.name[0] != '.') {
					str.Format("%s\\%s", path, c_file.name);
					if (! DelDir((LPCSTR)str)) {
						_findclose( hFile );
						return false;
					}
				}
			} else {
				str.Format("%s\\%s", path, c_file.name);
				if (remove((LPCSTR)str) == -1) {
					_findclose( hFile );
					return false;
				}
			}
		}
		_findclose( hFile );
		_rmdir(path);
	}
	return true;
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::SetFilterBandList
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		コンボボックスにフィルタの種類をセットする
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CComboBox		&cComboBox			[O] コンボボックス
//		int				nCurSel				[I] 初期選択位置
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::SetFilterBandList(CComboBox &cComboBox, int nCurSel)
{
	cComboBox.SetItemData(cComboBox.AddString("無し"), -1);
	cComboBox.SetItemData(cComboBox.AddString("LPF"), EDF_LPF);
	cComboBox.SetItemData(cComboBox.AddString("HPF"), EDF_HPF);
	cComboBox.SetItemData(cComboBox.AddString("BPF"), EDF_BPF);
	cComboBox.SetItemData(cComboBox.AddString("BSF"), EDF_BSF);

	cComboBox.SetCurSel(nCurSel);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::SetFilterOrderList
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		コンボボックスにフィルタの次数をセットする
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CComboBox		&cComboBox			[O] コンボボックス
//		int				nCurSel				[I] 初期選択位置
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::SetFilterOrderList(CComboBox &cComboBox, int nCurSel)
{
	CString sText;

	for (int nOrder = 1; nOrder <= 10; nOrder++) {
		sText.Format("%d", nOrder);
		cComboBox.SetItemData(cComboBox.AddString(sText), nOrder);
	}

	cComboBox.SetCurSel(nCurSel);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::SetFilterTypeList
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		コンボボックスにフィルタの特性をセットする
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CComboBox		&cComboBox			[O] コンボボックス
//		int				nCurSel				[I] 初期選択位置
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::SetFilterTypeList(CComboBox &cComboBox, int nCurSel)
{
	cComboBox.SetItemData(cComboBox.AddString("Butterworth"), EDF_Butterworth);
	cComboBox.SetItemData(cComboBox.AddString("Chebyshev"), EDF_Chebyshev);
	cComboBox.SetItemData(cComboBox.AddString("Bessel"), EDF_Bessel);

	cComboBox.SetCurSel(nCurSel);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::FormatExp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		指定した桁数の指数形式に変換
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		double		fData			[I] 変換するデータ
//		int			nDigit			[I] 小数部桁数
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		CString		変換した文字列
//*****************************************************************************************************
CString CGeneral::FormatExp(double fData, int nDigit)
{
	CString sFormat, sText;

	sFormat.Format("%%.%de", nDigit);
	sText.Format(sFormat, fData);
	int nPos = sText.Find('e');
	if (nPos >= 0) {
		CString sExp;
		sExp.Format("%d", atoi(sText.Mid(nPos + 1)));
		return sText.Left(nPos + 1) + sExp;
	} else
		return sText;
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::SetToolTip
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ツールチップを設定する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CToolTipCtrl	&tooltip			[I] ツールチップコントロール
//		SToolTipData	*pToolTipData		[I] ツールチップ表示データ
//		CWnd			*pWnd				[I] ウィンドウポインタ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::SetToolTip(CToolTipCtrl &tooltip, const SToolTipData *pToolTipData, CWnd *pWnd)
{
	tooltip.Create(pWnd);

	while (pToolTipData->nID) {
		CWnd *pWndControl = pWnd->GetDlgItem(pToolTipData->nID);
		if (pWndControl != NULL)
			tooltip.AddTool(pWndControl, pToolTipData->pMsg);
		pToolTipData++;
	}

	tooltip.SetMaxTipWidth(400);
	tooltip.EnableToolTips();
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::StrSplit
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		セパレータで区切られた文字列を分解して配列にセットする
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR			pText			[I] 文字列
//		LPCTSTR			pSeparator		[I] セパレータ
//		CStringArray	&saText			[O] 文字列配列
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::StrSplit(LPCTSTR pText, LPCTSTR pSeparator, CStringArray &saText)
{
	saText.RemoveAll();

	int nPos= 0;
	CString sText(pText);
	CString sToken = sText.Tokenize(pSeparator, nPos);

	while (sToken != "") {
		saText.Add(sToken);
		sToken = sText.Tokenize(pSeparator, nPos);
	}
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::StrJoin
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		文字列配列をセパレータで連結する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CStringArray	&saText			[I] 文字列配列
//		LPCTSTR			pSeparator		[I] セパレータ
//		CString			&sText			[O] 連結した文字列
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::StrJoin(const CStringArray &saText, LPCTSTR pSeparator, CString &sText)
{
	sText.Empty();

	for (int i = 0; i < saText.GetSize(); i++) {
		if (i != 0)
			sText += pSeparator;

		sText += saText[i];
	}
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::CheckFileName
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ファイル名（ディレクトリ名）として有効かチェックする
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CString			sText			[I] チェックする文字列
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL		TRUE:有効，FALSE:無効
//*****************************************************************************************************
BOOL CGeneral::CheckFileName(CString sText)
{
	return sText.SpanExcluding("\\/:*?\"<>|") == sText;
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::SetComboCategory
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		コンボボックスにカテゴリの選択肢を設定する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CComboBox		&oComboBox			[I] カテゴリのコンボボックス
//		CString			sChoiceText			[O] 現在設定されている文字列
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::SetComboCategory(CComboBox &oComboBox, CString sChoiceText)
{
	oComboBox.ResetContent();
	for (int i = 0; i < gChoiceCategory.GetSize(); i++) {
		if (CheckFileName(gChoiceCategory[i]))
			oComboBox.AddString(gChoiceCategory[i]);
	}

	oComboBox.SetWindowText(sChoiceText);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::SetComboMeasurementKind
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		コンボボックスに計測種類の選択肢を設定する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CComboBox		&oComboBox			[I] カテゴリのコンボボックス
//		CString			sChoiceText			[O] 現在設定されている文字列
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//*****************************************************************************************************
void CGeneral::SetComboMeasurementKind(CComboBox &oComboBox, CString sChoiceText)
{
	oComboBox.ResetContent();
	for (int i = 0; i < gChoiceMeasurementKind.GetSize(); i++) {
		if (CheckFileName(gChoiceMeasurementKind[i]))
			oComboBox.AddString(gChoiceMeasurementKind[i]);
	}

	oComboBox.SetWindowText(sChoiceText);
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::CheckFileName
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ファイル名（ディレクトリ名）として有効かチェックする
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		CString			sItem			[I] 項目名
//		CString			sText			[I] チェックする文字列
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL		TRUE:有効，FALSE:無効
//*****************************************************************************************************
BOOL CGeneral::CheckFileName(CString sItem, CString sText)
{
	if (!CheckFileName(sText)) {
		Alert("%sに「\\/:*?\"<>|」を含むことはできません。", sItem);
		return FALSE;
	}

	return TRUE;
}

//*****************************************************************************************************
//  1. 関数名
//		CGeneral::CreateDirectoryAll
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		指定されたディレクトリまで全ての階層のディレクトリを作成する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		LPCTSTR			pDirPath		[I] 作成するディレクトリ
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		BOOL		TRUE:正常，FALSE:エラー
//*****************************************************************************************************
BOOL CGeneral::CreateDirectoryAll(LPCTSTR pDirPath)
{
	DWORD err;
	char *p;
	char buf[_MAX_PATH];

	if (!::CreateDirectory(pDirPath, NULL)) {
		err = GetLastError();
		if (err == ERROR_ALREADY_EXISTS)
			return TRUE;
		else if (err == ERROR_PATH_NOT_FOUND) {
			strcpy_s(buf, pDirPath);
			if ((p = strrchr(buf, '\\')) != NULL) {
				*p = '\0';
				if (CreateDirectoryAll(buf))
					return CreateDirectory(pDirPath, NULL);
				else
					return FALSE;
			} else
				return FALSE;
		} else
			return FALSE;
	}

	return TRUE;
}
