#pragma once
//*****************************************************************************************************
//  1. ファイル名
//		RsuTaaTbl.h
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		RSUID-TAAID対応テーブル処理クラスの定義
//----------------------------------------------------------------------------------------------------
//  3. 備考
//----------------------------------------------------------------------------------------------------
//  4. 履歴
//		2008.12.01 S.Aizawa 新規作成
//*****************************************************************************************************

// RSUID-TAAID対応テーブルデータ
struct RSU_TAA_TBL
{
	int nRsuId;
	int nTaaId;
};
typedef CArray <RSU_TAA_TBL, RSU_TAA_TBL&> RSU_TAA_TBL_ARRAY;

// RSUID-TAAID対応テーブル処理クラス
class CRsuTaaTbl
{
public:
	bool SetTbl();
	int GetTaaId(int nRsuId);

protected:
	RSU_TAA_TBL_ARRAY m_aRsuTaaTbl;
};
