//*****************************************************************************************************
//  1. ファイル名
//		RsuTaaTbl.cpp
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		RSUID-TAAID対応テーブル処理クラスの実装
//----------------------------------------------------------------------------------------------------
//  3. 備考
//----------------------------------------------------------------------------------------------------
//  4. 履歴
//		2008.12.01 S.Aizawa 新規作成
//*****************************************************************************************************

#include "StdAfx.h"
#include "RsuTaaTbl.h"
#include "General.h"
#include "GlobalData.h"

// RSUID-TAAID対応テーブルのファイル名
#define	FN_RSU_TAA_TBL	"rsu_taa.tbl"

//*****************************************************************************************************
//  1. 関数名
//		CRsuTaaTbl::SetTbl
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		情報ファイル読み込み処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		bool	TRUE：正常　FALSE：エラー
//*****************************************************************************************************
bool CRsuTaaTbl::SetTbl()
{
	CString sPathName;
	CStdioFile oFile;
	CString sReadBuf;
	CStringArray saTblData;
	RSU_TAA_TBL oRsuTaaTbl;

	// ファイルをオープン
	sPathName.Format("%s\\%s", gExePath, FN_RSU_TAA_TBL);
	if (!oFile.Open(sPathName, CFile::modeRead | CFile::shareDenyNone))
		return false;

	// ヘッダを読み飛ばす
	oFile.ReadString(sReadBuf);

	// １行ずつテーブルに読み込む
	m_aRsuTaaTbl.RemoveAll();
	while (oFile.ReadString(sReadBuf)) {
		CGeneral::StrSplit(sReadBuf, ",", saTblData);
		if (saTblData.GetSize() >= 2) {
			oRsuTaaTbl.nRsuId = atoi(saTblData[0]);
			oRsuTaaTbl.nTaaId = atoi(saTblData[1]);
			m_aRsuTaaTbl.Add(oRsuTaaTbl);
		}
	}

	return true;
}

//*****************************************************************************************************
//  1. 関数名
//		CRsuTaaTbl::GetTaaId
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		RSU IDからTAA IDを取得する
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		int		nRsuId		[I] RSU ID
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		int		RSU ID
//*****************************************************************************************************
int CRsuTaaTbl::GetTaaId(int nRsuId)
{
	for (int i = 0; i < m_aRsuTaaTbl.GetSize(); i++) {
		if (m_aRsuTaaTbl[i].nRsuId == nRsuId)
			return m_aRsuTaaTbl[i].nTaaId;
	}

	return -1;
}
