/************************************************************************
 *									*
 *		ＡＣＥＳ　Ｓ／Ｇ　ＣＰＵプログラム			*
 *									*
 *		名称		: ＧＳＣ描画終了割り込み処理		*
 *		ファイル名	: intgsc.c				*
 *									*
 ************************************************************************/

#pragma	SECTION	PROG=intgsc

#include "sg_cpu.h"

/*=======================================================================
 |
 |		ＧＳＣ描画終了割り込み処理
 |
 |	void	intgsc()
 |
 =======================================================================*/
#pragma	INTERRUPT
void	intgsc()
{
//	word	ack;

//	ack = *GSC_ACK;		/* INT6 ACK */

	/* Ｄ／ＰをＲＡＰにセット */
	*(DP *)GSC_RAP_DP = dp_tmp;

	/* Ｐ／ＡビットをＲＡＰにセット */
	COPY_WORD(GSC_RAP_PA, pa_tmp, N_PABIT);

	calc_flag = 1;		/* 計算開始フラグセット */

	count_gscint++;		/* 表示周期カウンタ更新 */

	gsc_board_test = BIT_OK;	/* ＧＳＣボード正常 */

	tm_gscbackup = TM_GSCCHECK;	/* ＧＳＣ割り込み監視タイマーセット */
}
