/************************************************************************
 *									*
 *		新ＶＳＥシステム　ＰＣ－ＣＮＳプログラム		*
 *									*
 *		名称		: メイン処理				*
 *		ファイル名	: main.c				*
 *		作成日		: 91/04/01				*
 *									*
 ************************************************************************/

#include "pc_cns.h"

/*	内部関数定義	*/
static	void	interrupt far	int_stop(void);
static	void	set_gaiji(void);

/*	スタティック変数	*/
static	struct key_buf	func_save; /* ファンクションキーデータセーブエリア */
void	(far interrupt *stop_vect)();

/*=======================================================================
 |
 |		メイン処理
 |
 |	int	main()
 |
 =======================================================================*/
int	main(int argc, char *argv[])
{
	/* オプションチェック */
	while (--argc) {
		argv++;
		if (strcmp(*argv, "/T") == 0 || strcmp(*argv, "/t") == 0)
			opt_t = 1;
		else {
			printf("Bad option '%s'\n", *argv);
			exit(1);
		}
	}

	initialize();		/* 初期化処理 */

	find_csg();		/* コンソールＳＧファイル検索 */
	read_csg();		/* コンソールＳＧファイル読み込み */
	read_cmdfile();		/* コマンド選択ファイル読み込み */
	read_msgfile();		/* メッセージファイル読み込み */

	if (loctbl == NULL) {
		final();
		printf("ローカルコマンド選択ファイルがありません.\n");
		exit(1);
	}

	/* 開始メッセージ出力 */
	dsp_loc_msg(LOC_MSG_START, csg.nsg.sys_name);

	exec_prog(1);		/* 各処理起動 */

	final();		/* 終了処理 */

	return(0);
}

/*=======================================================================
 |
 |		初期化処理
 |
 |	void	initialize()
 |
 =======================================================================*/
void	initialize()
{
	signal(SIGINT, SIG_IGN);	/* ＳＴＯＰキーを無視する */

	stop_vect = _dos_getvect(0x06);	/* ＳＴＯＰキー割り込みベクタ保存 */
	_dos_setvect(0x06, int_stop);	/* ＳＴＯＰキー割り込み設定 */

	/*set_err_handler();*/	/* エラーハンドラセット */

	t_fget(&func_save);	/* ファンクションキーラベル取り出し */
	t_fput(&key_data);	/* ファンクションキーラベル設定 */

	cputs("\x1b[>1h");	/* 最下位行ユーザ使用 */
	t_csroff();		/* カーソル消去 */

	g_init();		/* グラフィック初期化 */
	g_screen(3, 0, 0, 1);	/* スクリーンモード設定 */
	g_cls();		/* グラフィック画面クリア */
	t_cls();		/* テキスト画面クリア */
	mouse = m_init();	/* マウスドライバ初期化 */
	set_gaiji();		/* 外字セット */
}

/*=======================================================================
 |
 |		ＳＴＯＰキー割り込み処理
 |
 |	void	int_stop()
 |
 =======================================================================*/
static	void	interrupt far	int_stop()
{
	stop_flag = 1;		/* ＳＴＯＰキー押下フラグセット */
}

/*=======================================================================
 |
 |		外字設定処理
 |
 |	void	set_gaiji()
 |
 =======================================================================*/
static	void	set_gaiji()
{
	static	char	gaiji_7622[] = {	/* リターンキー	*/
		0x02, 0x02,
		0x00, 0x00, 0x00, 0x00, 0x3f, 0xfc, 0x20, 0x04,
		0x20, 0x74, 0x20, 0x54, 0x22, 0x54, 0x26, 0x54,
		0x2b, 0x94, 0x30, 0x24, 0x2b, 0xc4, 0x26, 0x04,
		0x22, 0x04, 0x3f, 0xfc, 0x00, 0x00, 0x00, 0x00
	};
	static	char	gaiji_7628[] = {	/* 電話機のマーク */
		0x02, 0x02,
		0x00, 0x00, 0x0f, 0xf0, 0x3f, 0xfc, 0x7c, 0x3e,
		0x74, 0x2e, 0x74, 0x2e, 0x07, 0xe0, 0x1f, 0xf8,
		0x1c, 0x38, 0x30, 0x0c, 0x30, 0x0c, 0x70, 0x0e,
		0x70, 0x0e, 0x7c, 0x3e, 0x7f, 0xfe, 0x00, 0x00
	};
	static	char	gaiji_763d[] = {	/* 電話回線のマーク */
		0x02, 0x02,
		0x01, 0x80, 0x03, 0x80, 0x07, 0x80, 0x0d, 0x80,
		0x19, 0x80, 0x31, 0x80, 0x61, 0x80, 0xc1, 0x81,
		0x81, 0x83, 0x01, 0x86, 0x01, 0x8c, 0x01, 0x98,
		0x01, 0xb0, 0x01, 0xe0, 0x01, 0xc0, 0x01, 0x80
	};
	static	char	gaiji_7643[] = {	/* ディスクのマーク */
		0x02, 0x02,
		0x0f, 0xf0, 0x38, 0x1c, 0x60, 0x06, 0xe0, 0x07,
		0xb8, 0x1d, 0x8f, 0xf1, 0x80, 0x01, 0x80, 0x01,
		0x80, 0x01, 0x80, 0x01, 0x80, 0x01, 0x80, 0x01,
		0xc0, 0x03, 0x60, 0x06, 0x3c, 0x3c, 0x07, 0xe0
	};
	static	char	gaiji_7653[] = {	/* 点線の四角 */
		0x02, 0x02,
		0x00, 0x00, 0x4a, 0xaa, 0x00, 0x00, 0x40, 0x00,
		0x00, 0x02, 0x40, 0x00, 0x00, 0x02, 0x40, 0x00,
		0x00, 0x02, 0x40, 0x00, 0x00, 0x02, 0x40, 0x00,
		0x00, 0x02, 0x00, 0x00, 0x55, 0x52, 0x00, 0x00
	};

	t_setfont(0x7622, gaiji_7622);
	t_setfont(0x7628, gaiji_7628);
	t_setfont(0x763d, gaiji_763d);
	t_setfont(0x7643, gaiji_7643);
	t_setfont(0x7653, gaiji_7653);
}

/*=======================================================================
 |
 |		終了処理
 |
 |	void	final()
 |
 =======================================================================*/
void	final()
{
	_dos_setvect(0x06, stop_vect);	/* ＳＴＯＰキー割り込みベクタ復帰 */

	t_color(0xe1);		/* 文字色を白に設定 */

	cputs("\x1b[>1l");	/* 最下位行システム使用 */
	t_fput(&func_save);	/* ファンクションキーラベル設定 */

	t_csron();		/* カーソル表示 */
	m_csroff();		/* マウスカーソルＯＦＦ */

	g_cls();		/* グラフィック画面クリア */
	t_cls();		/* テキスト画面クリア */

	rs1_close();		/* ＲＳ－２３２Ｃクローズ */

	timreset();		/* タイマーリセット */

	/*spawnlp(0, "MEM", "MEM", 0L);*/	/* メモリサイズ表示 */
}
