/************************************************************************
 *									*
 *		新ＶＳＥシステム　ＰＣ－ＣＮＳプログラム		*
 *									*
 *		名称		: コネクション切断画面処理		*
 *		ファイル名	: prog8.c				*
 *		作成日		: 91/04/01				*
 *									*
 ************************************************************************/

#include "pc_cns.h"
#include	<time.h>

/*=======================================================================
 |
 |		コネクション切断画面処理
 |
 |	void	prog8()
 |
 =======================================================================*/
void	prog8()
{
	static	LINE	line[] = {	/* 罫線データ */
		{ 1,  1,  0, 79, 24},
		{ 3,  1,  2, 79,  2},
		{ 0,  1, 21, 79, 21},
		{-1}
	};
	int	ch;		/* 入力文字 */

	/* 画面消去 */
	t_cls();
	g_cls();

	/* 罫線表示 */
	dspline(line, C_WAKU);

	/* 画面表示 */
	xprintf(2, 1, C_ONLINE, msg20, ssg.nsg.sys_name, msg800);
	dspstr(2, 22, msg810, C_RED);
	dspstr(26, 22, msg820, C_GUIDE);

	dsp_msgenv();		/* メッセージ出力環境表示 */

	restore_scr();		/* 受信画面リストア */

	setfunc(0);	/* ファンクションキーセット */

	dsp_loc_msg(LOC_MSG_RESTART);	/* 再開メッセージ表示 */

	while (prog == 8) {
		/* コネクション開設要求メッセージ表示 */
		dsp_loc_msg(LOC_MSG_CONxxxT, ssg.nsg.conxxxtion);

		out_msg();	/* メッセージ出力 */

		if (conxxxt(0) == 0) {
			prog = 7;	/* メッセージ受信画面 */
		}
		while ((ch = inkey()) != 0) {
			if (ch == KEY_ESC)
				prog = 1;
		}
	}

	save_scr();		/* 受信画面セーブ */
}
