/************************************************************************
 *									*
 *		新ＶＳＥシステム　ＰＣ－ＣＮＳプログラム		*
 *									*
 *		名称		: 共通サブルーチン			*
 *		ファイル名	: sub.c					*
 *		作成日		: 91/04/01				*
 *									*
 ************************************************************************/

#include "pc_cns.h"

/*=======================================================================
 |
 |		プログラム呼び出し
 |
 |	void	exec_prog(start_prog)
 |
 |		int	start_prog;	スタートプログラム番号
 |
 =======================================================================*/
void	exec_prog(int start_prog)
{
	static	void	(*prog_tbl[])(void) = {	/* プログラムテーブル */
		prog1, prog2, prog3, prog4, prog5,
		prog6, prog7, prog8, prog9
	};
	int	tmp_prog;	/* 現プログラム番号セーブエリア */

	/* プログラム番号セット */
	prog = start_prog;

	/* 各処理起動 */
	while (prog) {
		/* キーボードバッファクリア */
		while (kbhit())
			getch();

		/* 現プログラム番号セーブ */
		tmp_prog = prog;

		/* プログラム呼び出し */
		(*prog_tbl[prog - 1])();

		/* 旧プログラム番号セーブ */
		old_prog = tmp_prog;
	}
}

/*=======================================================================
 |
 |		ベルを鳴らす
 |
 |	void	beep()
 |
 =======================================================================*/
void	beep()
{
	putch(0x07);
}

/*=======================================================================
 |
 |		最緊急用アラーム
 |
 |	void	alxxx_mj()
 |
 =======================================================================*/
void	alxxx_mj()
{
	int	i, j;		/* ループカウンタ */

	for (i = 0; i < 5; i++) {
		for (j = 0; j < 10; j++) {
			outp(0x37, 6);
			timset(5);
			while (tm_ovf == 0);

			outp(0x37, 7);
			timset(3);
			while (tm_ovf == 0);
		}

		outp(0x37, 7);
		timset(50);
		while (tm_ovf == 0);
	}
	tm_ovf = 0;
}

/*=======================================================================
 |
 |		緊急用アラーム
 |
 |	void	alxxx_mn()
 |
 =======================================================================*/
void	alxxx_mn()
{
	int	i;		/* ループカウンタ */

	for (i = 0; i < 3; i++) {
		outp(0x37, 6);
		timset(50);
		while (tm_ovf == 0);

		outp(0x37, 7);
		timset(50);
		while (tm_ovf == 0);
	}
	tm_ovf = 0;
}

/*=======================================================================
 |
 |		入力文字数カウント
 |
 |	int	strcount(p)
 |
 |		char	*p;		入力文字列
 |
 =======================================================================*/
int	strcount(char *p)
{
	int	i;

	for (i = strlen(p); i > 0; i--) {
		if (p[i-1] != ' ')
			break;
	}
	return(i);
}

/*=======================================================================
 |
 |		メモリ確保（エラーチェック有り）
 |
 |	void	*talloc(size)
 |
 |		int	size;		確保するメモリサイズ
 |
 =======================================================================*/
void	*talloc(int size)
{
	void	*p;

	if ((p = malloc(size)) == NULL) {
		final();
		printf("memory allocation error\n");
		exit(1);
	}

	return(p);
}

/*=======================================================================
 |
 |		キュー登録処理
 |
 |	void	en_queue(ptr, data, len)
 |
 |		QUEUE	**ptr;		キュー先頭ポインタ
 |		void	*data;		登録データ
 |		int	len;		データ長
 |
 =======================================================================*/
void	en_queue(QUEUE **ptr, void *data, int len)
{
	QUEUE	*qp;

	qp = talloc(sizeof(QUEUE));	/* メモリ確保 */
	qp->data = talloc(len);		/* データセーブエリア確保 */
	memcpy(qp->data, data, len);	/* データセーブ */
	qp->chain = NULL;		/* チェインポインタクリア */

	/* キューの最後を見つける */
	for ( ; *ptr != NULL; ptr = &(*ptr)->chain)
		;

	*ptr = qp;			/* キューに登録 */
}

/*=======================================================================
 |
 |		キュー取り出し処理
 |
 |	void	*de_queue(ptr)
 |
 |		QUEUE	**ptr;		キュー先頭ポインタ
 |
 =======================================================================*/
void	*de_queue(QUEUE **ptr)
{
	QUEUE	*qp;
	void	*data;

	qp = *ptr;

	if (qp != NULL) {
		data = qp->data;
		*ptr = qp->chain;
		free(qp);
	} else
		data = NULL;

	return(data);
}
