===================================================================
【創刊手続き完了メール】from:[@form_addr@]
====================================================================

発行者名：@user_nm@ さま
発行者基本メールアドレス：@mail_add_main@
メールマガジンタイトル：@mag_nm@


こんにちは。めろんぱん事務局の中島明です。
このたびは、めろんぱんでの新規メルマガ創刊のお申し込み、ありがとうご
ざいました。

これより貴誌の登録情報をもとに、「仮登録」のための審査をさせていただ
きます。その後、審査結果をお知らせすることになります。「仮登録」が承
認されますと、めろんぱんでの貴誌の発行が可能となります。


ご不明な点などございましたら、めろんぱんサイトのＦＡＱのページ
@faq_url@
から「メルマガの新規発行」をご参照いただくか、下記宛、メールにてお問
い合わせください。
●めろんぱん事務局「新創刊手続き係」: @form_addr@

それでは、審査結果の通知まで、今しばらくお待ちくださいますよう、お願
いいたします。

　　　　　　　　　　　　　　　　　　　　　　めろんぱん事務局　一同
===================================================================
