<?
$top = './..';
$inc = "$top/inc";
$img = "$top/image";
include("$inc/mn_header2.php");
?>
<?monitor_menu()?>
<!-- コンテンツ本体のソースはこの間に表記 -->
<TABLE cellSpacing=0 cellPadding=0 border=0 width="100%">
	<TBODY>
		<TR>
			<TD align="left" bgcolor="#EEEEEE" background="<?=$img?>/tit_bk.gif"><IMG src="<?=$img?>/tit_rules.gif" width=590 height=30 border=0 alt="モニター規約"></TD>
			<TD align="right" bgcolor="#EEEEEE" background="<?=$img?>/tit_bk.gif"><IMG src="<?=$img?>/tit_bk.gif" width=10 height=30 border=0></TD>
		</TR>
		<TR>
			<TD align="left" colspan="2"><IMG src="<?=$img?>/spacer.gif" width=1 height=15 border=0></TD>
		</TR>
	</TBODY>
</TABLE>
<table border="0" cellpadding="15" cellspacing="0" width="100%" bgcolor="white">
	<tr>
		<td><br>
			<table border="0" cellpadding="3" cellspacing="2" width="100%">
				<tr>
					<td bgcolor="#525294"><font color="white">モニター規約<br></font></td>
				</tr>
				<tr>
					<td><p><br>
					      <font size="2" color="#525294"><strong>第１条</strong></font><font size="2" color="black"><strong>（規約）<br>
					        </strong></font>
					      <font size="2" color="black"><br>
					        本規約は、株式会社○○○○○○（以下、「当社という」。）が実施、運営する 『きかせて・net』（以下、「本サイト」という。）上で提供する諸々のサービス（以下、「本サービス」という。） をモニター（当社に本サービスの利用を申し込み、当社がこれを承諾し、モニター資格を取得した者。） が利用することに関して、モニターと当社との間の一切の関係に適用するものです。<br>
					        <br>
					        <br>
					        <br>
			          </font><font size="2" color="#525294"><strong>第２条</strong></font><font size="2" color="black"><strong>（本規約の範囲及び変更）</strong></font><font size="2" color="#525294"><strong><br>
			          </strong></font><font size="2" color="black"><br>
		              当社は当社が定める方法により、モニターの承諾を得ることなく、本規約に新たな規定を追加又は変更できるものとし、 モニターは、追加又は変更後の規約内容を承諾するものとします。 なお、新たに追加又は変更される規定についても本規約の一部を構成するものとします。 追加又は変更された規約は、本サイトに１ヶ月表示した時点で、全員が承認したものとみなします。<br>
		              <br>
		              <br>
		              <br>
		              </font><font size="2" color="#525294"><strong>第３条</strong></font><font size="2" color="black"><strong>（当社からの通知）</strong></font><font size="2" color="#525294"><strong><br>
		              </strong></font><font size="2" color="black"><br>
	                  前条の場合の他、当社が必要と判断した場合、当社はモニターに対して随時必要な事項を通知します。 この通知内容は本サイト上に表示した時点で、直ちに全ての会員が承認したものとします。<br>
	                  <br>
	                  <br>
	                  <br>
	                  </font><font size="2" color="#525294"><strong>第４条</strong></font><font size="2" color="black"><strong>（規約の尊守）<br>
	                  </strong></font><font size="2" color="black"><br>
                      モニターは本サイトに参加するにあたり、本規約を遵守するものとします。</font><br>
                      <br>
                      <br>
                      <br>
                      <font size="2" color="#525294"><strong>第５条</strong></font><font size="2" color="black"><strong>（登録）<br>
                      </strong></font><font size="2" color="black"><br>
                      本サイトを利用しようとするものは当社に対し、当社が定める方法により、登録を行うものとします。 登録をした者は、その登録を行った時点で、本規約の内容を承諾したものとします。 当社はその登録者に対し、下記のいずれかに該当する場合を除いて、登録の承諾をするものとします。 この場合、当社は登録者に対し、その旨を当社が定める方法により通知するものとし、 登録者は当社がその通知を発した時点でモニター資格を取得するものとします。<br>
                      <br>
                      <br>
                      （１）登録をした者が実在しない場合 <br>
                      （２）過去に本モニター規約に違反した事がある場合 <br>
                      （３）登録内容に虚偽の申告があった場合 <br>
                      （４）その他、当社がモニターとして不適切と判断した場合<br>
                      <br>
                      <br>
                      当社は承認後であっても、承認した会員が上記のいずれかに該当することが判明した場合は、 その承認を取り消すことがあります。</font><font size="2" color="black"><br>
                      <br>
                      <br>
                      <br>
                      </font><font size="2" color="#525294"><strong>第６条</strong></font><font size="2" color="black"><strong>（メンバー情報）<br>
                      </strong></font><font size="2" color="black"><br>
                      本サービスを利用する上で必要となる、モニターの住所、電話番号、本サービスの利用状況等は、 当社のデータベースに個人情報として登録されます。当社は登録された情報を個人情報として管理するものとし、 次のいずれかに該当する場合を除き、第三者に提供しないものとします。 （本サイトのプライバシーポリシーもご覧下さい。）<br>
                      <br>
                      <br>
                      （１）モニターの同意が得られた場合 <br>
                      （２）法令等により開示が求められた場合 <br>
                      （３）個人識別ができない状態で提供する場合</font><font size="2" color="black"><br>
                      <br>
                      <br>
                      <br>
                      </font><font size="2" color="#525294"><strong>第７条</strong></font><font size="2" color="black"><strong>（回答内容の著作権）<br>
                      </strong></font><font size="2" color="black"><br>
                      １．モニターが行ったアンケート回答内容の著作権は、全て 当社が有するものとします。また、当社がその回答内容を自由に修正・編集、又は、 発行・発売するものに転載することをモニターは了承するものとします。<br>
                      <br>
                      ２．アンケート回答内容は当社、その調査を依頼した企業又は個人に公開されます。 （本サイトのプライバシーポリシーもご覧下さい。）</font><font size="2" color="black"><br>
                      <br>
                      <br>
                      <br>
                      </font><font size="2" color="#525294"><strong>第８条</strong></font><font size="2" color="black"><strong>（パスワードの管理）<br>
                      </strong></font><font size="2" color="black"><br>
                      モニターは、本サービスを利用する上で自らが指定するパスワードの管理、使用について一切の責任を持つと同時に、当該パスワードによる本サービスの利用に関しても一切の責任を負うものとします。尚、モニターはパスワードを第三者に譲渡、貸与、売買等をすることはできないものとします。</font><font size="2" color="black"><br>
                      <br>
                      <br>
                      <br>
                      </font><font size="2" color="#525294"><strong>第９条</strong></font><font size="2" color="black"><strong>（モニターの禁止事項）<br>
                      </strong></font><font size="2" color="black"><br>
                      モニターは本サービスの利用にあたり、次に掲げた行為をしてはならないものとします。<br>
                      <br>
                      <br>
                      （１）本サービスに関する情報を改ざんする行為 <br>
                      （２）ID・パスワードを不正に使用する行為 <br>
                      （３）有害なコンピュータープログラム等を送信又は書きこむ行為 <br>
                      （４）第三者の著作権、その他の知的財産権を侵害する行為 <br>
                      （５）第三者を誹謗中傷し、その他名誉を侵害する行為 <br>
                      （６）第三者の財産、プライバシーを侵害する行為 <br>
                      （７）第三者に不利益を与える行為 <br>
                      （８）選挙の事前運動、選挙運動、またはこれらに類似する場合及び公職選挙法に抵触する行為 <br>
                      （９）『きかせて・net』の運営を妨げる行為またはその虞のある行為 <br>
                      （１０）『きかせて・net』の信用を毀損する行為またはその虞のある行為 <br>
                      （１１）その他、法令に違反する、または違反する虞のある行為 <br>
                      （１２）その他、当社が不適切と判断する行為</font><font size="2"><br>
                      <br>
                      <br>
                      <br>
                      </font><font size="2" color="#525294"><strong>第10条</strong></font><font size="2" color="black"><strong>（モニターの守秘義務）<br>
                      </strong></font><font size="2" color="black"><br>
                      モニターは回答を求められたアンケートに対し、実際にアンケートに回答したか否かにかかわらず、当該アンケートを通じて知り得た情報について守秘義務を負うものとします。</font><font size="2" color="black"><br>
                      <br>
                      <br>
                      <br>
                      </font><font size="2" color="#525294"><strong>第11条</strong></font><font size="2" color="black"><strong>（電子メールの受発信）<br>
                      </strong></font><font size="2" color="black"><br>
                      １．モニターとして当社と電子メールの受発信を行う場合、登録情報と同一のメールアドレスを使用するものとします。<br>
                      <br>
                      ２．登録と異なるメールアドレスにて受発信を行った場合、当該モニターに不利益、損害が発生しても、当社は一切の責任を負わないものとします。<br>
                      <br>
                      ３．モニターは当社からの電子メールに対して返信するにあたり、当社の指定する方法により返信するものとします。<br>
                      <br>
                      ４．当社の指定と異なる方法で返信を行ったことにより、当該モニターに不利益、損害が発生しても、当社は一切の責任を負わないものとします。<br>
                      <br>
                      ５．モニターがモニターとして発信する電子メールの本文中の記載内容に関して、当社は一切の責任を負わないものとします。<br>
                      <br>
                      ６．当社からの電子メールの不達により、当該モニターに不利益、損害が発生しても、当社は一切の責任を負わないものとします。<br />
                      <br />
                      ７．当社からの電子メールの不達状態が一定回数を超えた場合には、当該モニターは自動的に「不達モニター」となります。この設定は当該モニター本人が登録情報の更新を行わない限り継続するものをします。</font><font size="2" color="black"><br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第12条</strong></font><font size="2" color="black"><strong>（変更の届け出）</strong><br>
                                              <br>
                                              モニターは、住所等、当社への届け出事項に変更があった場合には、速やかに当社へ所定の方法で届けるものとします。この届け出がなかったことによりモニターが不利益を被った場合でも、当社は一切の責任を負わないものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第13条</strong></font><font size="2" color="black"><strong>（ポイント）<br>
                                              </strong><br>
                                              １．当社がアンケートなどの協力者に配給するポイント数は、その負担の程度に応じて当社が決めるものとし、所定の方法により対象メンバーに事前に知らせるものとします。<br>
                                              <br>
                                              ２．ポイントの精算は当社が規定した基準ポイントまで達した段階で可能となり、当社が定めるポイント単位で精算することができます。<br>
                                              <br>
                                              ３．退会する場合は、そのモニターのポイント効力は消失するものとします。<br>
                                              <br>
                                              ４．ポイントの有効期限は入会後１年となります。有効期限を過ぎたポイントの効力は消失するものとします。ただし、モニターがアンケートへ回答しポイントを獲得したり、登録情報の更新手続きを行った場合、ポイントの有効期限を当社が指定する期間延長するものとします。<br>
                                              <br>
                                              ５．ポイントを譲渡、売買、営利目的又はその他不正に使用する事を固く禁じます。<br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><br>
                                              <strong>第14条</strong></font><font size="2" color="black"><strong>（設備）<br>
                                              </strong><br>
                                              モニターは本サービスを利用するために必要な通信機器、ソフトウェア、その他これらに付随して必要となるすべての機器を、自己の費用と責任において準備するものとします。また、自己の費用と責任で、任意の電気通信サービスを経由して本サイトに接続するものとします。また、本サイトに接続中に、当該モニターに不利益、損害が発生しても、当社は一切の責任を負わないものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第15条</strong></font><font size="2" color="black"><strong>（情報の削除）<br>
                                              </strong><br>
                                              当社は、モニターが本サービスを利用して掲示板等に掲載した情報が、当社の定める期間又は量を超えると当社が判断した場合、あるいは本サービスの運営、保守管理上の必要性から、または第９条に定める禁止事項に係る情報である場合は、モニターへの事前の通知、承諾なく情報を削除することができるものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第16条</strong></font><font size="2" color="black"><strong>（責任の制限）<br>
                                              </strong><br>
                                              １．当社は、モニターが本サービスの利用により被った損害に対し、一切の責任を負わないものとします。モニターは、本サービスの利用によって第三者に対して損害を与えた場合、事故の責任と費用をもって解決し、当社に損害を与えないものとします。<br>
                                              <br>
                                              ２．当社は、モニターが本サイトまたはインターネット通信サービスを 利用する事により得た情報について、一切の保証責任も負わないものとします。又、これらの情報等に起因して生じた損害等に対しても 一切の責任を負わないものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第17条</strong></font><font size="2" color="black"><strong>（著作権の帰属）<br>
                                              </strong><br>
                                              １．本サイトに掲載されるあらゆる情報、 デザイン及びそれを掲載する画面等の著作物の著作権は、特に明記のない限り、全て当社に帰属するものとします。<br>
                                              <br>
                                              ２．モニターは本サイトを利用する事により知り得た情報を、 当社の事前の承諾なしに複製、その他これを出版、放送するなど、その方法のいかんを問わず第三者により利用に供しないものとします。<br>
                                              <br>
                                              ３．本条の規定に違反して問題が発生した場合、メンバーは、自己の費用と責任においてかかる問題を解決するとともに、当社に何等の迷惑または損害を与えないものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第18条</strong></font><font size="2" color="black"><strong>（本サイトに登録、投稿された情報の変更、複写、移動等）<br>
                                              </strong><br>
                                              当社は、モニターから投稿された情報の全部又は一部を、必要に応じて、当社によるモニターへの事前の通知、 承認及び対価の支払いを要せず、題名、内容の変更、本サイト内での複写、移動を行うこと、及び本サービスに関し自由に利用する事ができるものとします。また、非公開形式で行われているサービスに関しても、管理及び運営上の理由により、当社がモニターの承諾無しに立ち入ることができるものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第19条</strong></font><font size="2" color="black"><strong>（サービスの一時的な中断）<br>
                                              </strong><br>
                                              当社は、次のいずれかに該当すると当社が判断した場合には、モニターへの事前の通知、承諾なく、一時的にサービスを中断できるものとします。<br>
                                              <br>
                                              <br>
                                              （１）保守管理を定期的に、または緊急に行う場合 <br>
                                              （２）火災、停電などにより本サービスが提供できなくなった場合 <br>
                                              （３）地震、洪水、津波などの天災により、本サービスが提供できなくなった場合 <br>
                                              （４）戦争、動乱、暴動、労働協議などにより本サービスが提供できなくなった場合 <br>
                                              （５）その他、運用上ないし技術上の理由から、 当社が本サービスの一時的中断を必要と判断した場合<br>
                                              <br>
                                              <br>
                                              当社は、上記または上記以外の理由によって、本サービスの提供の遅延及び中断などが発生した場合、あるいはそれに起因する、モニターまたは第三者が被った損害について、一切の責任を負わないこととします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第20条</strong></font><font size="2" color="black"><strong>（モニターの退会）<br>
                                              </strong><br>
                                              １．モニターが退会する際には、所定の手続きを当社に届け出るものとします。<br>
                                              <br>
                                              ２．モニターが退会する場合は、そのモニターのポイント効力は消失するものとします。<br>
                                              <br>
                                              ３．当社がモニターに付与するモニター資格は一身専属制のものとし、当該モニターが死亡した場合は、その事<br>
                                              実を知り得た時点で、当社が退会の手続きを取るものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第21条</strong></font><font size="2" color="black"><strong>（利用停止及び資格剥奪）<br>
                                              </strong><br>
                                              当社は、モニターが次のいずれかに該当すると判断した場合は、モニターへの事前の通知又は催告を要せず、 本サイトの利用の一時停止又はモニター資格を剥奪できるものとします。<br>
                                              <br>
                                              <br>
                                              （１）申し込み内容に虚偽があったことが判明した場合 <br>
                                              （２）本規約に違反した場合<br>
                                              （３）第１１条第７項における「不達モニター」の状態が６ヶ月以上継続した時 <br>
                                              <br>
                                              <br>
                                              尚、モニターの行った行為が上記又は第９条の事項のいずれかに該当し、当社が損害を被った場合、当社はモニター資格の剥奪ないしは本サービス利用の一時停止の有無に関係なく、被った損害の賠償を請求できるものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第22条</strong></font><font size="2" color="black"><strong>（本サービスの変更、追加、中止）<br>
                                              </strong><br>
                                              １．当社はモニターへの事前の通知、承諾を要せずに、本サービスの提供条件、運用規則、その他本サービスの内容に関する内容の全部又は一部について、変更、追加、中止することができ、モニターはこれを承諾するものとします。<br>
                                              <br>
                                              ２．サービスの変更・中止に伴い、メンバーに不利益や損害が発生した場合、当社は一切の責任を負わないものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第23条</strong></font><font size="2" color="black"><strong>（合意管轄）<br>
                                              </strong><br>
                                              当社及びモニターは、モニターと当社の間で本規約につき訴訟の必要が生じた場合は、東京地方裁判所を第一審の専属的合意管轄裁判所とすることを合意するものとします。<br>
                                              <br>
                                              <br>
                                              <br>
                                              </font><font size="2" color="#525294"><strong>第24条</strong></font><font size="2" color="black"><strong>（準拠法）<br>
                                              </strong><br>
                                              本規約の成立、効力、履行及び解釈に関しては、日本法が適用されるものとします。<br>
                                              </font></p>
					  <p align="right"><font size="2">2008年10月1日規約改訂<br>
				      <br>
				      </font>				      </p></td>
							</tr>
						</table>
					</td>
				</tr>
			</table>
		</td>
	</tr>
</table>
<!-- コンテンツ本体のソースはこの間に表記 -->
			</TD>
		</TR>
	</TBODY>
</TABLE>
</BODY>
</HTML>
