/************************************************************************
 *									*
 *		統合光波表示装置　Ｓ／Ｇ　ＣＰＵプログラム		*
 *									*
 *		名称		: ＧＳＣ描画終了割り込み処理		*
 *		ファイル名	: intgsc.c				*
 *									*
 ************************************************************************/

#pragma	SECTION	PROG=intgsc

#include "sg_cpu.h"

/*=======================================================================
 |
 |		ＧＳＣ描画終了割り込み処理
 |
 |	void	intgsc()
 |
 =======================================================================*/
#pragma	INTERRUPT
void	intgsc()
{
	word	ack;

	ack = *REG_GSC_ACK;		/* INT6 ACK */

	/* Ｄ／ＰをＲＡＰにセット */
	*(DP *)ADR_RAP_DP = dp_tmp;

	/* Ｐ／ＡビットをＲＡＰにセット */
	COPY_WORD(ADR_RAP_PA, pa_tmp, N_PABIT);

	count_gscint++;		/* 表示周期カウンタ更新 */
}
