// SubMenuDlg.cpp : インプリメンテーション ファイル
//

#include "stdafx.h"
#include "workscheduler.h"
#include "SubMenuDlg.h"

#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif

/////////////////////////////////////////////////////////////////////////////
// CSubMenuDlg ダイアログ


CSubMenuDlg::CSubMenuDlg(UINT nID, CWnd* pParent /*=NULL*/)
	: CDialogEx(nID, pParent)
{
	//{{AFX_DATA_INIT(CSubMenuDlg)
		// メモ - ClassWizard はこの位置にマッピング用のマクロを追加または削除します。
	//}}AFX_DATA_INIT
}


void CSubMenuDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialogEx::DoDataExchange(pDX);
	//{{AFX_DATA_MAP(CSubMenuDlg)
		// メモ - ClassWizard はこの位置にマッピング用のマクロを追加または削除します。
	//}}AFX_DATA_MAP
}


BEGIN_MESSAGE_MAP(CSubMenuDlg, CDialogEx)
	//{{AFX_MSG_MAP(CSubMenuDlg)
	ON_WM_SHOWWINDOW()
	//}}AFX_MSG_MAP
END_MESSAGE_MAP()

/////////////////////////////////////////////////////////////////////////////
// CSubMenuDlg メッセージ ハンドラ

//*****************************************************************************************************
//  1. 関数名
//		CSubMenuDlg::OnShowWindow
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		ダイアログ表示処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		BOOL		bShow			[I] ウィンドウ表示フラグ
//		UINT		nStatus			[I] ウィンドウの状態
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//----------------------------------------------------------------------------------------------------
//  5. 処理概要
//		メニューボタンの有効化する。
//----------------------------------------------------------------------------------------------------
//  6. 備考
//----------------------------------------------------------------------------------------------------
//  7. 履歴
//		2006.09.01 S.Aizawa(xxx) 新規作成
//*****************************************************************************************************
void CSubMenuDlg::OnShowWindow(BOOL bShow, UINT nStatus) 
{
	CDialogEx::OnShowWindow(bShow, nStatus);

	// メニューボタンの有効化
	EnableMenuButton();
}

void CSubMenuDlg::EnableMenuButton()
{
}

// Enterキーでダイアログが閉じるのを抑止
void CSubMenuDlg::OnOK()
{
}

//*****************************************************************************************************
//  1. 関数名
//		CSubMenuDlg::OnCancel
//----------------------------------------------------------------------------------------------------
//  2. 機能
//		キャンセルボタンクリック処理
//----------------------------------------------------------------------------------------------------
//  3. パラメータ説明
//		無し
//----------------------------------------------------------------------------------------------------
//  4. 戻り値
//		無し
//----------------------------------------------------------------------------------------------------
//  5. 処理概要
//		何もしない。
//----------------------------------------------------------------------------------------------------
//  6. 備考
//		ESCキーを押してもダイアログが閉じないように親クラスの関数をオーバーライドする。
//----------------------------------------------------------------------------------------------------
//  7. 履歴
//		2006.09.01 S.Aizawa(xxx) 新規作成
//*****************************************************************************************************
void CSubMenuDlg::OnCancel()
{
}
