/************************************************************************
 *									*
 *		ＩＳＡＭライブラリ					*
 *									*
 *		名称		: ｄＢＡＳＥ互換関数			*
 *		ファイル名	: func.c				*
 *		作成者		: s.aizawa				*
 *									*
 ************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include "isam.h"

/*=======================================================================
 |
 |		レコード数取り出し
 |
 |	long	db_reccount(dbp)
 |
 |		DB	*dbp;		ＤＢポインタ
 |
 |		返値			レコード数
 |
 =======================================================================*/
long	db_reccount(DB *dbp)
{
	return(dbp->dp->dhp->n_rec);
}

/*=======================================================================
 |
 |		ＢＯＦチェック
 |
 |	int	db_bof(dbp)
 |
 |		DB	*dbp;		ＤＢポインタ
 |
 |		返値			０：ＢＯＦでない　１：ＢＯＦ
 |
 =======================================================================*/
int	db_bof(DB *dbp)
{
	return(dbp->bof);
}

/*=======================================================================
 |
 |		データファイル名取り出し
 |
 |	char	*db_dbf(dbp)
 |
 |		DB	*dbp;		ＤＢポインタ
 |
 |		返値			データファイル名へのポインタ
 |
 =======================================================================*/
char	*db_dbf(DB *dbp)
{
	return(dbp->dp->file_name);
}

/*=======================================================================
 |
 |		ＥＯＦチェック
 |
 |	int	db_eof(dbp)
 |
 |		DB	*dbp;		ＤＢポインタ
 |
 |		返値			０：ＥＯＦでない　１：ＥＯＦ
 |
 =======================================================================*/
int	db_eof(DB *dbp)
{
	return(dbp->eof);
}

/*=======================================================================
 |
 |		フィールド名取り出し
 |
 |	char	*db_field(dbp, n)
 |
 |		DB	*dbp;		ＤＢポインタ
 |		int	n;		フィールド番号
 |
 |		返値			フィールド名へのポインタ
 |
 =======================================================================*/
char	*db_field(DB *dbp, int n)
{
	DBF	*dp;

	dp = dbp->dp;
	if (n < 1 || n > dp->n_field)
		return(NULL);

	return(dp->flp[n-1].name);
}

/*=======================================================================
 |
 |		インデックスファイル名取り出し
 |
 |	char	*db_ndx(dbp, n)
 |
 |		DB	*dbp;		ＤＢポインタ
 |		int	n;		インデックスファイル番号
 |
 |		返値			インデックスファイル名へのポインタ
 |
 =======================================================================*/
char	*db_ndx(DB *dbp, int n)
{
	if (n < 1 || n > dbp->n_idx)
		return(NULL);

	return(dbp->ip[n]->file_name);
}

/*=======================================================================
 |
 |		カレントレコード番号取り出し
 |
 |	long	db_recno(dbp)
 |
 |		DB	*dbp;		ＤＢポインタ
 |
 |		返値			カレントレコード番号
 |
 =======================================================================*/
long	db_recno(DB *dbp)
{
	return(dbp->rno);
}

/*=======================================================================
 |
 |		レコード長取り出し
 |
 |	int	db_recsize(dbp)
 |
 |		DB	*dbp;		ＤＢポインタ
 |
 |		返値			レコード長
 |
 =======================================================================*/
int	db_recsize(DB *dbp)
{
	return(dbp->dp->dhp->l_rec);
}

/*=======================================================================
 |
 |		削除レコード処理モード設定
 |
 |	void	set_deleted(flag)
 |
 |		int	flag;		０：削除レコード有効
 |					１：削除レコード無効
 |
 =======================================================================*/
void	set_deleted(int flag)
{
	_db_set_deleted = flag;
}

