<?php
/**
 * トップ画面設定
 *
 * @author y.fujimori
 * @version $Id: config.inc.php,v 1.34 2009/07/14 02:13:07 cvshitobito Exp $
 */

// --- 事務局からのお知らせ表示設定 --------------------
// 1 ：表示     
// 0 ：非表示   
// -----------------------------------------------------
define('ADMIN_INFO_BLOCK_VIEW_STATUS', 1);

// --- アンケートＩＤ設定 ------------------------------
// 「情報が存在しないＩＤ」、又は「ＩＤ無し」の場合、
// ブロックを非表示とする
// -----------------------------------------------------
define('ENQUETE_RESULT_VIEW_ID', 338);

// --- ビデオ表示設定 ----------------------------------
// 1 ：表示     
// 0 ：非表示   
// -----------------------------------------------------
define('TOP_VIDEO_BLOCK_VIEW_STATUS', 0);

?>